----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\t\Documents\GitHub\StataTraining\Day2\Data\DataViz.log
  log type:  text
 opened on:   2 Jan 2016, 21:33:20

. 
. * Introduce visualization types and show resources. Talk about imporantance
. * of visualizing data (https://en.wikipedia.org/wiki/Anscombe%27s_quartet).
. 
. clear all

. input x1        y1      x2      y2      x3      y3      x4      y4

            x1         y1         x2         y2         x3         y3         x4         y4
  1. 10.0    8.04    10.0    9.14    10.0    7.46    8.0     6.58
  2. 8.0     6.95    8.0     8.14    8.0     6.77    8.0     5.76
  3. 13.0    7.58    13.0    8.74    13.0    12.74   8.0     7.71
  4. 9.0     8.81    9.0     8.77    9.0     7.11    8.0     8.84
  5. 11.0    8.33    11.0    9.26    11.0    7.81    8.0     8.47
  6. 14.0    9.96    14.0    8.10    14.0    8.84    8.0     7.04
  7. 6.0     7.24    6.0     6.13    6.0     6.08    8.0     5.25
  8. 4.0     4.26    4.0     3.10    4.0     5.39    19.0    12.50
  9. 12.0    10.84   12.0    9.13    12.0    8.15    8.0     5.56
 10. 7.0     4.82    7.0     7.26    7.0     6.42    8.0     7.91
 11. 5.0     5.68    5.0     4.74    5.0     5.73    8.0     6.89
 12. end

. save "quartet.dta", replace
file quartet.dta saved

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tddens y4 x4

. 
end of do-file

. ssc install hmap
checking hmap consistency and verifying not already installed...
all files already exist and are up to date.

. help hmap

. clear all

. 
.    set obs 64
obs was 0, now 64

. 
.    g n=int(uniform()*10)

. 
.    g x=1+int((_n-1)/8)

. 
.    g y=1+mod((_n-1),8)

. 
.    la def xlab 1 "one" 2 "two" 7 "seven" 8 "eight"

. 
.    la def ylab 3 "three" 4 "four" 5 "five" 6 "six"

. 
.    la val x xlab

. 
.    la val y ylab

. 
.    ta y x [fw=n]

           |                                            x
         y |       one        two          3          4          5          6      seven      eight |     Total
-----------+----------------------------------------------------------------------------------------+----------
         1 |         1          5          2          8          2          9          5          0 |        32 
         2 |         6          8          5          4          0          2          7          1 |        33 
     three |         5          2          2          4          5          2          0          2 |        22 
      four |         6          0          9          8          3          1          8          6 |        41 
      five |         6          4          2          0          8          7          2          8 |        37 
       six |         1          8          1          6          1          3          4          4 |        28 
         7 |         6          5          4          7          5          3          1          2 |        33 
         8 |         0          8          7          6          1          9          2          9 |        42 
-----------+----------------------------------------------------------------------------------------+----------
     Total |        31         40         32         43         25         36         29         32 |       268 


. 
.    hmap x y n

. hmap x y n, sc

. "ssc install gma
unrecognized command:  "ssc install gma invalid command name
r(199);

. ssc install gmap
checking gmap consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.

. help gmap

. dir
  <dir>   1/02/16 21:33  .                 
  <dir>   1/02/16 21:33  ..                
   3.8k  12/31/15 23:43  column_numbers.dta
   0.0k   1/02/16 21:33  DataViz.log       
   8.6k   1/01/16  0:53  Day2Homework.log  
   7.5k  12/31/15 23:56  FA_merge.dta      
   3.7k  12/31/15 23:43  gdp_cpd.dta       
   1.8k  12/31/15 23:43  hh.dta            
   1.8k  12/31/15 23:43  hh2.dta           
   1.8k  12/31/15 23:43  hh3.dta           
   2.5k  12/31/15 23:43  ind.dta           
   2.5k  12/31/15 23:43  ind2.dta          
   2.4k  12/31/15 23:43  ind_ag.dta        
   2.4k  12/31/15 23:43  ind_age.dta       
  17.3k  12/31/15 23:43  MessyDataExamples.smcl
   7.0k  12/31/15 23:43  mVars_column.dta  
   2.4k   1/02/16 21:33  quartet.dta       
 380.9k  12/31/15 23:43  StataTraining.csv 
 878.9k  12/31/15 23:43  StataTrainingClean.dta
 368.6k  12/31/15 23:43  StataTrainingMessy.csv
   3.2k  12/31/15 23:43  vars_row_columns.dta
   5.8k  12/31/15 23:43  wb_gdp_wide.dta   
   2.3k  12/31/15 23:43  wb_indicators.csv 
   5.6k   1/01/16  0:53  wb_indicators_long.dta

. use StataTrainingClean
no; data in memory would be lost
r(4);

. use StataTrainingClean, clear

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. sum

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  fiscalyear |      2417    2011.329    1.530527       2007       2014
         qtr |      2322    2.578381    1.148259          1          4
fiscalyear~e |         0
     account |         0
      agency |         0
-------------+--------------------------------------------------------
operatingu~t |         0
benefiting~y |         0
    category |         0
      sector |         0
      amount |         0
-------------+--------------------------------------------------------
       spent |      2407    2.171756    15.13846    -7.6169   501.9166
      spent2 |      2407     2171756    1.51e+07   -7616900   5.02e+08
  notCountry |      2417     .191146    .3932852          0          1

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. sum spent, detail 

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.3607914        -7.6169
 5%     -.004491          -6.69
10%      .000068       -5.42145       Obs                2407
25%     .0254098      -4.825231       Sum of Wgt.        2407

50%     .2137813                      Mean           2.171756
                        Largest       Std. Dev.      15.13846
75%     .9163505       154.5814
90%            3        208.985       Variance        229.173
95%      6.01795       297.7359       Skewness       21.12665
99%     28.62951       501.9166       Kurtosis       584.6251

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. bysort fiscalyear: sum spent, d

----------------------------------------------------------------------------------------
-> fiscalyear = 2007

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0220026       .0220026
 5%     .0220026              .
10%     .0220026              .       Obs                   1
25%     .0220026              .       Sum of Wgt.           1

50%     .0220026                      Mean           .0220026
                        Largest       Std. Dev.             .
75%     .0220026              .
90%     .0220026              .       Variance              .
95%     .0220026              .       Skewness              .
99%     .0220026       .0220026       Kurtosis              .

----------------------------------------------------------------------------------------
-> fiscalyear = 2008

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%      134.585        134.585
 5%      134.585              .
10%      134.585              .       Obs                   1
25%      134.585              .       Sum of Wgt.           1

50%      134.585                      Mean            134.585
                        Largest       Std. Dev.             .
75%      134.585              .
90%      134.585              .       Variance              .
95%      134.585              .       Skewness              .
99%      134.585        134.585       Kurtosis              .

----------------------------------------------------------------------------------------
-> fiscalyear = 2009

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0890967          -6.69
 5%     2.27e-06      -4.825231
10%     .0021133      -.5763986       Obs                 393
25%      .036018      -.0890967       Sum of Wgt.         393

50%      .211934                      Mean           1.215735
                        Largest       Std. Dev.      3.312959
75%     .8580108       18.49886
90%     2.978422         22.074       Variance        10.9757
95%     5.620903       23.43839       Skewness       4.496801
99%     18.49886       25.83019       Kurtosis       26.23547

----------------------------------------------------------------------------------------
-> fiscalyear = 2010

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -.014044          -3.08
 5%    -.0006822      -.1555388
10%     .0006494      -.1332148       Obs                 401
25%      .026665      -.0825301       Sum of Wgt.         401

50%     .2310116                      Mean           2.245192
                        Largest       Std. Dev.      10.75151
75%     .9102859           73.3
90%      2.78015       98.63298       Variance       115.5949
95%     7.403542       113.3203       Skewness       8.926467
99%     30.33898        122.407       Kurtosis       88.94369

----------------------------------------------------------------------------------------
-> fiscalyear = 2011

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -.17613             -2
 5%     -.001935          -.248
10%     .0001071      -.2342066       Obs                 451
25%       .02143            -.2       Sum of Wgt.         451

50%     .1943747                      Mean           2.116126
                        Largest       Std. Dev.       10.5945
75%      .904635       42.01596
90%          2.9       48.09723       Variance       112.2433
95%     7.067815        134.811       Skewness       11.47308
99%     34.80169       154.5814       Kurtosis       151.9745

----------------------------------------------------------------------------------------
-> fiscalyear = 2012

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1029548      -4.639095
 5%    -.0006179       -.958923
10%     .0023495            -.2       Obs                 464
25%     .0354176        -.10304       Sum of Wgt.         464

50%      .223268                      Mean           3.715323
                        Largest       Std. Dev.      28.00194
75%     1.221706           66.8
90%     4.089603       112.6652       Variance       784.1089
95%     8.023576       297.7359       Skewness        14.8561
99%     49.68336       501.9166       Kurtosis       243.7783

----------------------------------------------------------------------------------------
-> fiscalyear = 2013

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.479624        -7.6169
 5%     -.150062       -5.42145
10%    -.0077066      -3.445094       Obs                 564
25%      .012076      -3.253825       Sum of Wgt.         564

50%     .2116153                      Mean           1.420509
                        Largest       Std. Dev.      9.937029
75%     .8246578       22.70937
90%     2.431764          36.02       Variance       98.74455
95%     4.535394       94.12495       Skewness        17.7555
99%     15.64618        208.985       Kurtosis         352.53

----------------------------------------------------------------------------------------
-> fiscalyear = 2014

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0702099      -.2586957
 5%    -.0080243      -.0702099
10%     .0007875       -.020496       Obs                 132
25%     .0276348      -.0141936       Sum of Wgt.         132

50%     .1639026                      Mean           1.782233
                        Largest       Std. Dev.      9.713572
75%      .481635       10.57392
90%     2.674218       13.69908       Variance       94.35349
95%     4.601889       31.82208       Skewness       9.754368
99%     31.82208       106.1701       Kurtosis         103.32


. 
end of do-file

. help summarize

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. bysort fiscalyear: sum spent if inlist("USAID", agency), d

----------------------------------------------------------------------------------------
-> fiscalyear = 2007

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0220026       .0220026
 5%     .0220026              .
10%     .0220026              .       Obs                   1
25%     .0220026              .       Sum of Wgt.           1

50%     .0220026                      Mean           .0220026
                        Largest       Std. Dev.             .
75%     .0220026              .
90%     .0220026              .       Variance              .
95%     .0220026              .       Skewness              .
99%     .0220026       .0220026       Kurtosis              .

----------------------------------------------------------------------------------------
-> fiscalyear = 2008

                            Spent
-------------------------------------------------------------
no observations

----------------------------------------------------------------------------------------
-> fiscalyear = 2009

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0890967          -6.69
 5%    -9.87e-06      -4.825231
10%     .0019869      -.5763986       Obs                 380
25%     .0294603      -.0890967       Sum of Wgt.         380

50%     .2046317                      Mean           1.152452
                        Largest       Std. Dev.      3.123834
75%     .8591579       17.47528
90%     2.960369       18.49886       Variance       9.758339
95%     5.298716         22.074       Skewness       4.570973
99%     17.47528       25.83019       Kurtosis       27.64181

----------------------------------------------------------------------------------------
-> fiscalyear = 2010

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0825301          -3.08
 5%    -.0008629      -.1555388
10%      .000411      -.1332148       Obs                 375
25%     .0209095      -.0825301       Sum of Wgt.         375

50%     .2212105                      Mean           2.139053
                        Largest       Std. Dev.      10.47625
75%     .9102859       30.33898
90%     3.052856       98.63298       Variance       109.7518
95%     7.403542       113.3203       Skewness       9.514566
99%     30.33898        122.407       Kurtosis       100.2549

----------------------------------------------------------------------------------------
-> fiscalyear = 2011

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -.17613             -2
 5%     -.002776          -.248
10%      .000025      -.2342066       Obs                 428
25%     .0176297            -.2       Sum of Wgt.         428

50%     .2159387                      Mean           2.212014
                        Largest       Std. Dev.      10.86725
75%     .9572554       42.01596
90%     3.118599       48.09723       Variance       118.0972
95%     7.936803        134.811       Skewness       11.17775
99%     34.80169       154.5814       Kurtosis       144.2981

----------------------------------------------------------------------------------------
-> fiscalyear = 2012

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1029548      -4.639095
 5%    -.0016073       -.958923
10%     .0002262            -.2       Obs                 422
25%      .033308        -.10304       Sum of Wgt.         422

50%      .223268                      Mean           2.067312
                        Largest       Std. Dev.       7.96222
75%     1.259455             48
90%     3.653265       49.68336       Variance       63.39695
95%     7.430453           66.8       Skewness       9.061188
99%     28.94898       112.6652       Kurtosis       106.0436

----------------------------------------------------------------------------------------
-> fiscalyear = 2013

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.3607914      -2.852668
 5%     -.033446      -.9022455
10%    -.0024933       -.403556       Obs                 392
25%     .0109244      -.3607914       Sum of Wgt.         392

50%     .1748246                      Mean           .7686441
                        Largest       Std. Dev.      1.935026
75%      .709585       8.870124
90%     2.261913       13.02041       Variance       3.744326
95%     3.741494       15.64618       Skewness       6.280351
99%     8.870124       22.70937       Kurtosis       57.84819

----------------------------------------------------------------------------------------
-> fiscalyear = 2014

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.2586957      -.2586957
 5%    -.0095786      -.0702099
10%     -.000593       -.020496       Obs                  83
25%     .0161056      -.0141936       Sum of Wgt.          83

50%     .1866794                      Mean            1.41272
                        Largest       Std. Dev.      4.022592
75%     1.168957        6.01795
90%     3.010352       10.57392       Variance       16.18125
95%         5.86       13.69908       Skewness       5.818689
99%     31.82208       31.82208       Kurtosis       41.77603


. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. bysort fiscalyear: sum spent

----------------------------------------------------------------------------------------
-> fiscalyear = 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |         1    .0220026           .   .0220026   .0220026

----------------------------------------------------------------------------------------
-> fiscalyear = 2008

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |         1     134.585           .    134.585    134.585

----------------------------------------------------------------------------------------
-> fiscalyear = 2009

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |       393    1.215735    3.312959      -6.69   25.83019

----------------------------------------------------------------------------------------
-> fiscalyear = 2010

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |       401    2.245192    10.75151      -3.08    122.407

----------------------------------------------------------------------------------------
-> fiscalyear = 2011

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |       451    2.116126     10.5945         -2   154.5814

----------------------------------------------------------------------------------------
-> fiscalyear = 2012

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |       464    3.715323    28.00194  -4.639095   501.9166

----------------------------------------------------------------------------------------
-> fiscalyear = 2013

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |       564    1.420509    9.937029    -7.6169    208.985

----------------------------------------------------------------------------------------
-> fiscalyear = 2014

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |       132    1.782233    9.713572  -.2586957   106.1701


. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. bysort fiscalyear: sum spent if inlist("USAID", agency), d

----------------------------------------------------------------------------------------
-> fiscalyear = 2007

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0220026       .0220026
 5%     .0220026              .
10%     .0220026              .       Obs                   1
25%     .0220026              .       Sum of Wgt.           1

50%     .0220026                      Mean           .0220026
                        Largest       Std. Dev.             .
75%     .0220026              .
90%     .0220026              .       Variance              .
95%     .0220026              .       Skewness              .
99%     .0220026       .0220026       Kurtosis              .

----------------------------------------------------------------------------------------
-> fiscalyear = 2008

                            Spent
-------------------------------------------------------------
no observations

----------------------------------------------------------------------------------------
-> fiscalyear = 2009

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0890967          -6.69
 5%    -9.87e-06      -4.825231
10%     .0019869      -.5763986       Obs                 380
25%     .0294603      -.0890967       Sum of Wgt.         380

50%     .2046317                      Mean           1.152452
                        Largest       Std. Dev.      3.123834
75%     .8591579       17.47528
90%     2.960369       18.49886       Variance       9.758339
95%     5.298716         22.074       Skewness       4.570973
99%     17.47528       25.83019       Kurtosis       27.64181

----------------------------------------------------------------------------------------
-> fiscalyear = 2010

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0825301          -3.08
 5%    -.0008629      -.1555388
10%      .000411      -.1332148       Obs                 375
25%     .0209095      -.0825301       Sum of Wgt.         375

50%     .2212105                      Mean           2.139053
                        Largest       Std. Dev.      10.47625
75%     .9102859       30.33898
90%     3.052856       98.63298       Variance       109.7518
95%     7.403542       113.3203       Skewness       9.514566
99%     30.33898        122.407       Kurtosis       100.2549

----------------------------------------------------------------------------------------
-> fiscalyear = 2011

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%      -.17613             -2
 5%     -.002776          -.248
10%      .000025      -.2342066       Obs                 428
25%     .0176297            -.2       Sum of Wgt.         428

50%     .2159387                      Mean           2.212014
                        Largest       Std. Dev.      10.86725
75%     .9572554       42.01596
90%     3.118599       48.09723       Variance       118.0972
95%     7.936803        134.811       Skewness       11.17775
99%     34.80169       154.5814       Kurtosis       144.2981

----------------------------------------------------------------------------------------
-> fiscalyear = 2012

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1029548      -4.639095
 5%    -.0016073       -.958923
10%     .0002262            -.2       Obs                 422
25%      .033308        -.10304       Sum of Wgt.         422

50%      .223268                      Mean           2.067312
                        Largest       Std. Dev.       7.96222
75%     1.259455             48
90%     3.653265       49.68336       Variance       63.39695
95%     7.430453           66.8       Skewness       9.061188
99%     28.94898       112.6652       Kurtosis       106.0436

----------------------------------------------------------------------------------------
-> fiscalyear = 2013

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.3607914      -2.852668
 5%     -.033446      -.9022455
10%    -.0024933       -.403556       Obs                 392
25%     .0109244      -.3607914       Sum of Wgt.         392

50%     .1748246                      Mean           .7686441
                        Largest       Std. Dev.      1.935026
75%      .709585       8.870124
90%     2.261913       13.02041       Variance       3.744326
95%     3.741494       15.64618       Skewness       6.280351
99%     8.870124       22.70937       Kurtosis       57.84819

----------------------------------------------------------------------------------------
-> fiscalyear = 2014

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.2586957      -.2586957
 5%    -.0095786      -.0702099
10%     -.000593       -.020496       Obs                  83
25%     .0161056      -.0141936       Sum of Wgt.          83

50%     .1866794                      Mean            1.41272
                        Largest       Std. Dev.      4.022592
75%     1.168957        6.01795
90%     3.010352       10.57392       Variance       16.18125
95%         5.86       13.69908       Skewness       5.818689
99%     31.82208       31.82208       Kurtosis       41.77603


. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab fiscalyear agency, mi

           |                         Agency
FiscalYear |       DOD        DOS        IAF        MCC  Peace C.. |     Total
-----------+-------------------------------------------------------+----------
      2007 |         0          0          0          0          0 |         1 
      2008 |         0          0          0          0          0 |         1 
      2009 |         0          0          5          0          0 |       394 
      2010 |         0          0          7          0         12 |       403 
      2011 |         0          0          5          0         12 |       455 
      2012 |         0         10          3          0         21 |       465 
      2013 |         0          4          5        141         15 |       566 
      2014 |        24          1          2          0         21 |       132 
-----------+-------------------------------------------------------+----------
     Total |        24         15         27        141         81 |     2,417 


           |                   Agency
FiscalYear |  Treasury      USADF      USAID       USDA |     Total
-----------+--------------------------------------------+----------
      2007 |         0          0          1          0 |         1 
      2008 |         1          0          0          0 |         1 
      2009 |         2          6        381          0 |       394 
      2010 |         1          6        377          0 |       403 
      2011 |         3          3        432          0 |       455 
      2012 |         4          4        423          0 |       465 
      2013 |         4          3        392          2 |       566 
      2014 |         0          1         83          0 |       132 
-----------+--------------------------------------------+----------
     Total |        15         23      2,089          2 |     2,417 


. 
end of do-file

. ssc install tabsort
ssc install: "tabsort" not found at SSC, type -findit tabsort-
(To find all packages at SSC that start with t, type -ssc describe t-)
r(601);

. findit tabsort

. help tabsort

. help tabsort

. tab agency

             Agency |      Freq.     Percent        Cum.
--------------------+-----------------------------------
                DOD |         24        0.99        0.99
                DOS |         15        0.62        1.61
                IAF |         27        1.12        2.73
                MCC |        141        5.83        8.56
        Peace Corps |         81        3.35       11.92
           Treasury |         15        0.62       12.54
              USADF |         23        0.95       13.49
              USAID |      2,089       86.43       99.92
               USDA |          2        0.08      100.00
--------------------+-----------------------------------
              Total |      2,417      100.00

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab agency, gen(agency_dummy)

             Agency |      Freq.     Percent        Cum.
--------------------+-----------------------------------
                DOD |         24        0.99        0.99
                DOS |         15        0.62        1.61
                IAF |         27        1.12        2.73
                MCC |        141        5.83        8.56
        Peace Corps |         81        3.35       11.92
           Treasury |         15        0.62       12.54
              USADF |         23        0.95       13.49
              USAID |      2,089       86.43       99.92
               USDA |          2        0.08      100.00
--------------------+-----------------------------------
              Total |      2,417      100.00

. 
end of do-file

. drop agency_*

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab agency, gen(agency_flag)

             Agency |      Freq.     Percent        Cum.
--------------------+-----------------------------------
                DOD |         24        0.99        0.99
                DOS |         15        0.62        1.61
                IAF |         27        1.12        2.73
                MCC |        141        5.83        8.56
        Peace Corps |         81        3.35       11.92
           Treasury |         15        0.62       12.54
              USADF |         23        0.95       13.49
              USAID |      2,089       86.43       99.92
               USDA |          2        0.08      100.00
--------------------+-----------------------------------
              Total |      2,417      100.00

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort fiscalyear agency

           |                   Agency
FiscalYear |     USAID        MCC  Peace Cor        IAF |     Total
-----------+--------------------------------------------+----------
      2013 |       392        141         15          5 |       566 
      2012 |       423          0         21          3 |       465 
      2011 |       432          0         12          5 |       455 
      2010 |       377          0         12          7 |       403 
      2009 |       381          0          0          5 |       394 
      2014 |        83          0         21          2 |       132 
      2007 |         1          0          0          0 |         1 
      2008 |         0          0          0          0 |         1 
-----------+--------------------------------------------+----------
     Total |     2,089        141         81         27 |     2,417 


           |                   Agency
FiscalYear |       DOD      USADF        DOS   Treasury |     Total
-----------+--------------------------------------------+----------
      2013 |         0          3          4          4 |       566 
      2012 |         0          4         10          4 |       465 
      2011 |         0          3          0          3 |       455 
      2010 |         0          6          0          1 |       403 
      2009 |         0          6          0          2 |       394 
      2014 |        24          1          1          0 |       132 
      2007 |         0          0          0          0 |         1 
      2008 |         0          0          0          1 |         1 
-----------+--------------------------------------------+----------
     Total |        24         23         15         15 |     2,417 


           |   Agency
FiscalYear |      USDA |     Total
-----------+-----------+----------
      2013 |         2 |       566 
      2012 |         0 |       465 
      2011 |         0 |       455 
      2010 |         0 |       403 
      2009 |         0 |       394 
      2014 |         0 |       132 
      2007 |         0 |         1 
      2008 |         0 |         1 
-----------+-----------+----------
     Total |         2 |     2,417 


. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab fiscalyear, sum(spent)

            |          Summary of Spent
 FiscalYear |        Mean   Std. Dev.       Freq.
------------+------------------------------------
       2007 |   .02200264           0           1
       2008 |   134.58496           0           1
       2009 |   1.2157354   3.3129589         393
       2010 |   2.2451917   10.751505         401
       2011 |   2.1161262   10.594496         451
       2012 |   3.7153234   28.001944         464
       2013 |   1.4205091   9.9370291         564
       2014 |   1.7822329   9.7135725         132
------------+------------------------------------
      Total |   2.1717564   15.138462        2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort fiscalyear agency

           |                   Agency
FiscalYear |     USAID        MCC  Peace Cor        IAF |     Total
-----------+--------------------------------------------+----------
      2013 |       392        141         15          5 |       566 
      2012 |       423          0         21          3 |       465 
      2011 |       432          0         12          5 |       455 
      2010 |       377          0         12          7 |       403 
      2009 |       381          0          0          5 |       394 
      2014 |        83          0         21          2 |       132 
      2007 |         1          0          0          0 |         1 
      2008 |         0          0          0          0 |         1 
-----------+--------------------------------------------+----------
     Total |     2,089        141         81         27 |     2,417 


           |                   Agency
FiscalYear |       DOD      USADF        DOS   Treasury |     Total
-----------+--------------------------------------------+----------
      2013 |         0          3          4          4 |       566 
      2012 |         0          4         10          4 |       465 
      2011 |         0          3          0          3 |       455 
      2010 |         0          6          0          1 |       403 
      2009 |         0          6          0          2 |       394 
      2014 |        24          1          1          0 |       132 
      2007 |         0          0          0          0 |         1 
      2008 |         0          0          0          1 |         1 
-----------+--------------------------------------------+----------
     Total |        24         23         15         15 |     2,417 


           |   Agency
FiscalYear |      USDA |     Total
-----------+-----------+----------
      2013 |         2 |       566 
      2012 |         0 |       465 
      2011 |         0 |       455 
      2010 |         0 |       403 
      2009 |         0 |       394 
      2014 |         0 |       132 
      2007 |         0 |         1 
      2008 |         0 |         1 
-----------+-----------+----------
     Total |         2 |     2,417 


. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort agency fiscalyear, sort(spent)
sort(spent) not allowed without summarize()
r(198);

end of do-file

r(198);

. help tabsort

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort agency fiscalyear, su(spent)

            Means, Standard Deviations and Frequencies of Spent

           |                    FiscalYear
    Agency |      2013       2012       2011       2010       2009 |     T
> otal
-----------+-------------------------------------------------------+------
> ----
     USAID | .76864415  2.0673116  2.2120135  2.1390525  1.1524523 | 1.671
> 2207
           | 1.9350262  7.9622202  10.867254   10.47625  3.1238341 | 7.763
> 2464
           |       392        422        428        375        380 |      
> 2081
-----------+-------------------------------------------------------+------
> ----
       MCC | 2.7437354          .          .          .          . | 2.743
> 7354
           | 18.072078          .          .          .          . | 18.07
> 2078
           |       139          0          0          0          0 |      
>  139
-----------+-------------------------------------------------------+------
> ----
 Peace Cor | .88949094  .67318506   .4472586  .99100866          . |  .592
> 7542
           |  .5565522  .79474224  .61345184  .61237843          . | .6441
> 1451
           |        15         21         12         12          0 |      
>   81
-----------+-------------------------------------------------------+------
> ----
       IAF |   .254795  .15026033   .0983458  .23127672   .4373914 | .2370
> 7015
           |  .2148782  .01064719  .03536208  .18011329  .34037304 | .2128
> 6984
           |         5          3          5          7          5 |      
>   27
-----------+-------------------------------------------------------+------
> ----
       DOD |         .          .          .          .          . |  4.75
> 6706
           |         .          .          .          .          . |  21.6
> 1229
           |         0          0          0          0          0 |      
>   24
-----------+-------------------------------------------------------+------
> ----
     USADF | .09581337   .0167152   .2674171  1.8943513  .49575143 | .6749
> 4948
           | .11967583  .01438889  .24143777  4.1336605   .5215011 | 2.128
> 9512
           |         3          4          3          6          6 |      
>   23
-----------+-------------------------------------------------------+------
> ----
       DOS | 25.214991  83.623778          .          .          . | 62.48
> 3729
           | 46.031461  173.52613          .          .          . | 144.2
> 3886
           |         4         10          0          0          0 |      
>   15
-----------+-------------------------------------------------------+------
> ----
  Treasury | .32265806  .15306249  .32334076  73.300003  17.345321 | 16.36
> 3234
           | .29564765  .18233826  .25511127          0  8.6169043 | 37.93
> 5055
           |         4          4          3          1          2 |      
>   15
-----------+-------------------------------------------------------+------
> ----
      USDA | .71251595          .          .          .          . | .7125
> 1595
           | .27912922          .          .          .          . | .2791
> 2922
           |         2          0          0          0          0 |      
>    2
-----------+-------------------------------------------------------+------
> ----
     Total | 1.4205091  3.7153234  2.1161262  2.2451917  1.2157354 | 2.171
> 7564
           | 9.9370291  28.001944  10.594496  10.751505  3.3129589 | 15.13
> 8462
           |       564        464        451        401        393 |      
> 2407

           |          FiscalYear
    Agency |      2014       2007       2008 |     Total
-----------+---------------------------------+----------
     USAID | 1.4127205  .02200264          . | 1.6712207
           | 4.0225923          0          . | 7.7632464
           |        83          1          0 |      2081
-----------+---------------------------------+----------
       MCC |         .          .          . | 2.7437354
           |         .          .          . | 18.072078
           |         0          0          0 |       139
-----------+---------------------------------+----------
 Peace Cor | .15593489          .          . |  .5927542
           | .12966367          .          . | .64411451
           |        21          0          0 |        81
-----------+---------------------------------+----------
       IAF |  .1892575          .          . | .23707015
           | .06574608          .          . | .21286984
           |         2          0          0 |        27
-----------+---------------------------------+----------
       DOD |  4.756706          .          . |  4.756706
           |  21.61229          .          . |  21.61229
           |        24          0          0 |        24
-----------+---------------------------------+----------
     USADF | .02666961          .          . | .67494948
           |         0          .          . | 2.1289512
           |         1          0          0 |        23
-----------+---------------------------------+----------
       DOS |  .1581808          .          . | 62.483729
           |         0          .          . | 144.23886
           |         1          0          0 |        15
-----------+---------------------------------+----------
  Treasury |         .          .  134.58496 | 16.363234
           |         .          .          0 | 37.935055
           |         0          0          1 |        15
-----------+---------------------------------+----------
      USDA |         .          .          . | .71251595
           |         .          .          . | .27912922
           |         0          0          0 |         2
-----------+---------------------------------+----------
     Total | 1.7822329  .02200264  134.58496 | 2.1717564
           | 9.7135725          0          0 | 15.138462
           |       132          1          1 |      2407

. 
end of do-file

. help tabsort

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort agency fiscalyear, su(spent) so(mean)

            Means, Standard Deviations and Frequencies of Spent

           |                    FiscalYear
    Agency |      2008       2012       2010       2011       2014 |     T
> otal
-----------+-------------------------------------------------------+------
> ----
       DOS |         .  83.623778          .          .   .1581808 | 62.48
> 3729
           |         .  173.52613          .          .          0 | 144.2
> 3886
           |         0         10          0          0          1 |      
>   15
-----------+-------------------------------------------------------+------
> ----
  Treasury | 134.58496  .15306249  73.300003  .32334076          . | 16.36
> 3234
           |         0  .18233826          0  .25511127          . | 37.93
> 5055
           |         1          4          1          3          0 |      
>   15
-----------+-------------------------------------------------------+------
> ----
       DOD |         .          .          .          .   4.756706 |  4.75
> 6706
           |         .          .          .          .   21.61229 |  21.6
> 1229
           |         0          0          0          0         24 |      
>   24
-----------+-------------------------------------------------------+------
> ----
       MCC |         .          .          .          .          . | 2.743
> 7354
           |         .          .          .          .          . | 18.07
> 2078
           |         0          0          0          0          0 |      
>  139
-----------+-------------------------------------------------------+------
> ----
     USAID |         .  2.0673116  2.1390525  2.2120135  1.4127205 | 1.671
> 2207
           |         .  7.9622202   10.47625  10.867254  4.0225923 | 7.763
> 2464
           |         0        422        375        428         83 |      
> 2081
-----------+-------------------------------------------------------+------
> ----
      USDA |         .          .          .          .          . | .7125
> 1595
           |         .          .          .          .          . | .2791
> 2922
           |         0          0          0          0          0 |      
>    2
-----------+-------------------------------------------------------+------
> ----
     USADF |         .   .0167152  1.8943513   .2674171  .02666961 | .6749
> 4948
           |         .  .01438889  4.1336605  .24143777          0 | 2.128
> 9512
           |         0          4          6          3          1 |      
>   23
-----------+-------------------------------------------------------+------
> ----
 Peace Cor |         .  .67318506  .99100866   .4472586  .15593489 |  .592
> 7542
           |         .  .79474224  .61237843  .61345184  .12966367 | .6441
> 1451
           |         0         21         12         12         21 |      
>   81
-----------+-------------------------------------------------------+------
> ----
       IAF |         .  .15026033  .23127672   .0983458   .1892575 | .2370
> 7015
           |         .  .01064719  .18011329  .03536208  .06574608 | .2128
> 6984
           |         0          3          7          5          2 |      
>   27
-----------+-------------------------------------------------------+------
> ----
     Total | 134.58496  3.7153234  2.2451917  2.1161262  1.7822329 | 2.171
> 7564
           |         0  28.001944  10.751505  10.594496  9.7135725 | 15.13
> 8462
           |         1        464        401        451        132 |      
> 2407

           |          FiscalYear
    Agency |      2013       2009       2007 |     Total
-----------+---------------------------------+----------
       DOS | 25.214991          .          . | 62.483729
           | 46.031461          .          . | 144.23886
           |         4          0          0 |        15
-----------+---------------------------------+----------
  Treasury | .32265806  17.345321          . | 16.363234
           | .29564765  8.6169043          . | 37.935055
           |         4          2          0 |        15
-----------+---------------------------------+----------
       DOD |         .          .          . |  4.756706
           |         .          .          . |  21.61229
           |         0          0          0 |        24
-----------+---------------------------------+----------
       MCC | 2.7437354          .          . | 2.7437354
           | 18.072078          .          . | 18.072078
           |       139          0          0 |       139
-----------+---------------------------------+----------
     USAID | .76864415  1.1524523  .02200264 | 1.6712207
           | 1.9350262  3.1238341          0 | 7.7632464
           |       392        380          1 |      2081
-----------+---------------------------------+----------
      USDA | .71251595          .          . | .71251595
           | .27912922          .          . | .27912922
           |         2          0          0 |         2
-----------+---------------------------------+----------
     USADF | .09581337  .49575143          . | .67494948
           | .11967583   .5215011          . | 2.1289512
           |         3          6          0 |        23
-----------+---------------------------------+----------
 Peace Cor | .88949094          .          . |  .5927542
           |  .5565522          .          . | .64411451
           |        15          0          0 |        81
-----------+---------------------------------+----------
       IAF |   .254795   .4373914          . | .23707015
           |  .2148782  .34037304          . | .21286984
           |         5          5          0 |        27
-----------+---------------------------------+----------
     Total | 1.4205091  1.2157354  .02200264 | 2.1717564
           | 9.9370291  3.3129589          0 | 15.138462
           |       564        393          1 |      2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort agency fiscalyear, su(spent) so(mean)

            Means, Standard Deviations and Frequencies of Spent

           |                    FiscalYear
    Agency |      2008       2012       2010       2011       2014 |     Total
-----------+-------------------------------------------------------+----------
       DOS |         .  83.623778          .          .   .1581808 | 62.483729
           |         .  173.52613          .          .          0 | 144.23886
           |         0         10          0          0          1 |        15
-----------+-------------------------------------------------------+----------
  Treasury | 134.58496  .15306249  73.300003  .32334076          . | 16.363234
           |         0  .18233826          0  .25511127          . | 37.935055
           |         1          4          1          3          0 |        15
-----------+-------------------------------------------------------+----------
       DOD |         .          .          .          .   4.756706 |  4.756706
           |         .          .          .          .   21.61229 |  21.61229
           |         0          0          0          0         24 |        24
-----------+-------------------------------------------------------+----------
       MCC |         .          .          .          .          . | 2.7437354
           |         .          .          .          .          . | 18.072078
           |         0          0          0          0          0 |       139
-----------+-------------------------------------------------------+----------
     USAID |         .  2.0673116  2.1390525  2.2120135  1.4127205 | 1.6712207
           |         .  7.9622202   10.47625  10.867254  4.0225923 | 7.7632464
           |         0        422        375        428         83 |      2081
-----------+-------------------------------------------------------+----------
      USDA |         .          .          .          .          . | .71251595
           |         .          .          .          .          . | .27912922
           |         0          0          0          0          0 |         2
-----------+-------------------------------------------------------+----------
     USADF |         .   .0167152  1.8943513   .2674171  .02666961 | .67494948
           |         .  .01438889  4.1336605  .24143777          0 | 2.1289512
           |         0          4          6          3          1 |        23
-----------+-------------------------------------------------------+----------
 Peace Cor |         .  .67318506  .99100866   .4472586  .15593489 |  .5927542
           |         .  .79474224  .61237843  .61345184  .12966367 | .64411451
           |         0         21         12         12         21 |        81
-----------+-------------------------------------------------------+----------
       IAF |         .  .15026033  .23127672   .0983458   .1892575 | .23707015
           |         .  .01064719  .18011329  .03536208  .06574608 | .21286984
           |         0          3          7          5          2 |        27
-----------+-------------------------------------------------------+----------
     Total | 134.58496  3.7153234  2.2451917  2.1161262  1.7822329 | 2.1717564
           |         0  28.001944  10.751505  10.594496  9.7135725 | 15.138462
           |         1        464        401        451        132 |      2407

           |          FiscalYear
    Agency |      2013       2009       2007 |     Total
-----------+---------------------------------+----------
       DOS | 25.214991          .          . | 62.483729
           | 46.031461          .          . | 144.23886
           |         4          0          0 |        15
-----------+---------------------------------+----------
  Treasury | .32265806  17.345321          . | 16.363234
           | .29564765  8.6169043          . | 37.935055
           |         4          2          0 |        15
-----------+---------------------------------+----------
       DOD |         .          .          . |  4.756706
           |         .          .          . |  21.61229
           |         0          0          0 |        24
-----------+---------------------------------+----------
       MCC | 2.7437354          .          . | 2.7437354
           | 18.072078          .          . | 18.072078
           |       139          0          0 |       139
-----------+---------------------------------+----------
     USAID | .76864415  1.1524523  .02200264 | 1.6712207
           | 1.9350262  3.1238341          0 | 7.7632464
           |       392        380          1 |      2081
-----------+---------------------------------+----------
      USDA | .71251595          .          . | .71251595
           | .27912922          .          . | .27912922
           |         2          0          0 |         2
-----------+---------------------------------+----------
     USADF | .09581337  .49575143          . | .67494948
           | .11967583   .5215011          . | 2.1289512
           |         3          6          0 |        23
-----------+---------------------------------+----------
 Peace Cor | .88949094          .          . |  .5927542
           |  .5565522          .          . | .64411451
           |        15          0          0 |        81
-----------+---------------------------------+----------
       IAF |   .254795   .4373914          . | .23707015
           |  .2148782  .34037304          . | .21286984
           |         5          5          0 |        27
-----------+---------------------------------+----------
     Total | 1.4205091  1.2157354  .02200264 | 2.1717564
           | 9.9370291  3.3129589          0 | 15.138462
           |       564        393          1 |      2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort agency, su(spent) so(mean)

            |          Summary of Spent
     Agency |        Mean   Std. Dev.       Freq.
------------+------------------------------------
        DOS |   62.483729   144.23886          15
   Treasury |   16.363234   37.935055          15
        DOD |    4.756706    21.61229          24
        MCC |   2.7437354   18.072078         139
      USAID |   1.6712207   7.7632464        2081
       USDA |   .71251595   .27912922           2
      USADF |   .67494948   2.1289512          23
  Peace Cor |    .5927542   .64411451          81
        IAF |   .23707015   .21286984          27
------------+------------------------------------
      Total |   2.1717564   15.138462        2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort agency, sum(spent) so(mean)

            |          Summary of Spent
     Agency |        Mean   Std. Dev.       Freq.
------------+------------------------------------
        DOS |   62.483729   144.23886          15
   Treasury |   16.363234   37.935055          15
        DOD |    4.756706    21.61229          24
        MCC |   2.7437354   18.072078         139
      USAID |   1.6712207   7.7632464        2081
       USDA |   .71251595   .27912922           2
      USADF |   .67494948   2.1289512          23
  Peace Cor |    .5927542   .64411451          81
        IAF |   .23707015   .21286984          27
------------+------------------------------------
      Total |   2.1717564   15.138462        2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab agency, sum(spent)

                   |          Summary of Spent
            Agency |        Mean   Std. Dev.       Freq.
-------------------+------------------------------------
               DOD |    4.756706    21.61229          24
               DOS |   62.483729   144.23886          15
               IAF |   .23707015   .21286984          27
               MCC |   2.7437354   18.072078         139
       Peace Corps |    .5927542   .64411451          81
          Treasury |   16.363234   37.935055          15
             USADF |   .67494948   2.1289512          23
             USAID |   1.6712207   7.7632464        2081
              USDA |   .71251595   .27912922           2
-------------------+------------------------------------
             Total |   2.1717564   15.138462        2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort agency fiscalyear

            |                                       FiscalYear
     Agency |      2013       2012       2011       2010       2009       2014       2007       2008 |     Total
------------+----------------------------------------------------------------------------------------+----------
      USAID |       392        423        432        377        381         83          1          0 |     2,089 
        MCC |       141          0          0          0          0          0          0          0 |       141 
Peace Corps |        15         21         12         12          0         21          0          0 |        81 
        IAF |         5          3          5          7          5          2          0          0 |        27 
        DOD |         0          0          0          0          0         24          0          0 |        24 
      USADF |         3          4          3          6          6          1          0          0 |        23 
        DOS |         4         10          0          0          0          1          0          0 |        15 
   Treasury |         4          4          3          1          2          0          0          1 |        15 
       USDA |         2          0          0          0          0          0          0          0 |         2 
------------+----------------------------------------------------------------------------------------+----------
      Total |       566        465        455        403        394        132          1          1 |     2,417 


. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab fiscalyear, sum(spent)

            |          Summary of Spent
 FiscalYear |        Mean   Std. Dev.       Freq.
------------+------------------------------------
       2007 |   .02200264           0           1
       2008 |   134.58496           0           1
       2009 |   1.2157354   3.3129589         393
       2010 |   2.2451917   10.751505         401
       2011 |   2.1161262   10.594496         451
       2012 |   3.7153234   28.001944         464
       2013 |   1.4205091   9.9370291         564
       2014 |   1.7822329   9.7135725         132
------------+------------------------------------
      Total |   2.1717564   15.138462        2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab category, sum(spent)

                                  |          Summary of Spent
                         Category |        Mean   Std. Dev.       Freq.
----------------------------------+------------------------------------
Democracy, Human Rights, And Go.. |   .86232319   3.1592994         331
             Economic Development |   2.2603739   12.612496         397
    Education And Social Services |   3.3497407   14.927056         169
                      Environment |    .9408328   1.5564635          78
                           Health |   2.5166118   10.860611         462
          Humanitarian Assistance |    2.660461   9.9091297         175
                          Missing |   6.7722268   48.153285         149
                     Multi-Sector |   4.7676435   20.674787          55
               Peace And Security |   .73567216   2.6492001         116
               Program Management |   .88474447   2.6738027         475
----------------------------------+------------------------------------
                            Total |   2.1717564   15.138462        2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort category, sum(spent)

            |          Summary of Spent
   Category |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Program M |   .88474447   2.6738027         475
     Health |   2.5166118   10.860611         462
  Economic  |   2.2603739   12.612496         397
  Democracy |   .86232319   3.1592994         331
  Humanitar |    2.660461   9.9091297         175
  Education |   3.3497407   14.927056         169
    Missing |   6.7722268   48.153285         149
  Peace And |   .73567216   2.6492001         116
  Environme |    .9408328   1.5564635          78
  Multi-Sec |   4.7676435   20.674787          55
------------+------------------------------------
      Total |   2.1717564   15.138462        2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort category, sum(spent) sort (spent)

            |          Summary of Spent
   Category |        Mean   Std. Dev.       Freq.
------------+------------------------------------
    Missing |   6.7722268   48.153285         149
  Multi-Sec |   4.7676435   20.674787          55
  Education |   3.3497407   14.927056         169
  Economic  |   2.2603739   12.612496         397
     Health |   2.5166118   10.860611         462
  Humanitar |    2.660461   9.9091297         175
  Democracy |   .86232319   3.1592994         331
  Program M |   .88474447   2.6738027         475
  Peace And |   .73567216   2.6492001         116
  Environme |    .9408328   1.5564635          78
------------+------------------------------------
      Total |   2.1717564   15.138462        2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab fiscalyear, sum(spent)

            |          Summary of Spent
 FiscalYear |        Mean   Std. Dev.       Freq.
------------+------------------------------------
       2007 |   .02200264           0           1
       2008 |   134.58496           0           1
       2009 |   1.2157354   3.3129589         393
       2010 |   2.2451917   10.751505         401
       2011 |   2.1161262   10.594496         451
       2012 |   3.7153234   28.001944         464
       2013 |   1.4205091   9.9370291         564
       2014 |   1.7822329   9.7135725         132
------------+------------------------------------
      Total |   2.1717564   15.138462        2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort category, sum(spent) sort (spent)

            |          Summary of Spent
   Category |        Mean   Std. Dev.       Freq.
------------+------------------------------------
    Missing |   6.7722268   48.153285         149
  Multi-Sec |   4.7676435   20.674787          55
  Education |   3.3497407   14.927056         169
  Economic  |   2.2603739   12.612496         397
     Health |   2.5166118   10.860611         462
  Humanitar |    2.660461   9.9091297         175
  Democracy |   .86232319   3.1592994         331
  Program M |   .88474447   2.6738027         475
  Peace And |   .73567216   2.6492001         116
  Environme |    .9408328   1.5564635          78
------------+------------------------------------
      Total |   2.1717564   15.138462        2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabsort agency fiscalyear

            |                                       FiscalYear
     Agency |      2013       2012       2011       2010       2009       2014       2007       2008 |     Total
------------+----------------------------------------------------------------------------------------+----------
      USAID |       392        423        432        377        381         83          1          0 |     2,089 
        MCC |       141          0          0          0          0          0          0          0 |       141 
Peace Corps |        15         21         12         12          0         21          0          0 |        81 
        IAF |         5          3          5          7          5          2          0          0 |        27 
        DOD |         0          0          0          0          0         24          0          0 |        24 
      USADF |         3          4          3          6          6          1          0          0 |        23 
        DOS |         4         10          0          0          0          1          0          0 |        15 
   Treasury |         4          4          3          1          2          0          0          1 |        15 
       USDA |         2          0          0          0          0          0          0          0 |         2 
------------+----------------------------------------------------------------------------------------+----------
      Total |       566        465        455        403        394        132          1          1 |     2,417 


. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabstat fiscalyear category, stat(mean median sd n)
varlist:  category:  string variable not allowed
r(109);

end of do-file

r(109);

. help tabstat

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabstat spent by(fiscalyear agency), stat(mean median sd n)
factor variables and time-series operators not allowed
r(101);

end of do-file

r(101);

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabstat spent, by(fiscalyear agency) stat(mean median sd n)
by():  too many variables specified
r(103);

end of do-file

r(103);

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabstat spent, by(fiscalyear) stat(mean median sd n)

Summary for variables: spent
     by categories of: fiscalyear (FiscalYear)

fiscalyear |      mean       p50        sd         N
-----------+----------------------------------------
      2007 |  .0220026  .0220026         .         1
      2008 |   134.585   134.585         .         1
      2009 |  1.215735   .211934  3.312959       393
      2010 |  2.245192  .2310116  10.75151       401
      2011 |  2.116126  .1943747   10.5945       451
      2012 |  3.715323   .223268  28.00194       464
      2013 |  1.420509  .2116153  9.937029       564
      2014 |  1.782233  .1639026  9.713572       132
-----------+----------------------------------------
     Total |  2.171756  .2137813  15.13846      2407
----------------------------------------------------

. 
end of do-file

. help tabstat

. tabstat spent, by(fiscalyear) stat(mean median sd n) long

fiscalyear     variable |      mean       p50        sd         N
------------------------+----------------------------------------
2007              spent |  .0220026  .0220026         .         1
2008              spent |   134.585   134.585         .         1
2009              spent |  1.215735   .211934  3.312959       393
2010              spent |  2.245192  .2310116  10.75151       401
2011              spent |  2.116126  .1943747   10.5945       451
2012              spent |  3.715323   .223268  28.00194       464
2013              spent |  1.420509  .2116153  9.937029       564
2014              spent |  1.782233  .1639026  9.713572       132
------------------------+----------------------------------------
Total             spent |  2.171756  .2137813  15.13846      2407
-----------------------------------------------------------------

. tabstat spent, by(fiscalyear) stat(mean median sd n) long format

fiscalyear     variable |      mean       p50        sd         N
------------------------+----------------------------------------
2007              spent |  .0220026  .0220026         .         1
2008              spent |   134.585   134.585         .         1
2009              spent |  1.215735   .211934  3.312959       393
2010              spent |  2.245192  .2310116  10.75151       401
2011              spent |  2.116126  .1943747   10.5945       451
2012              spent |  3.715323   .223268  28.00194       464
2013              spent |  1.420509  .2116153  9.937029       564
2014              spent |  1.782233  .1639026  9.713572       132
------------------------+----------------------------------------
Total             spent |  2.171756  .2137813  15.13846      2407
-----------------------------------------------------------------

. tabstat spent, by(fiscalyear) stat(mean median sd n) long format col(stat)

fiscalyear     variable |      mean       p50        sd         N
------------------------+----------------------------------------
2007              spent |  .0220026  .0220026         .         1
2008              spent |   134.585   134.585         .         1
2009              spent |  1.215735   .211934  3.312959       393
2010              spent |  2.245192  .2310116  10.75151       401
2011              spent |  2.116126  .1943747   10.5945       451
2012              spent |  3.715323   .223268  28.00194       464
2013              spent |  1.420509  .2116153  9.937029       564
2014              spent |  1.782233  .1639026  9.713572       132
------------------------+----------------------------------------
Total             spent |  2.171756  .2137813  15.13846      2407
-----------------------------------------------------------------

. grmeanby agency qtr, summarize(spent)

. grmeanby agency, summarize(spent)

. tab agency

             Agency |      Freq.     Percent        Cum.
--------------------+-----------------------------------
                DOD |         24        0.99        0.99
                DOS |         15        0.62        1.61
                IAF |         27        1.12        2.73
                MCC |        141        5.83        8.56
        Peace Corps |         81        3.35       11.92
           Treasury |         15        0.62       12.54
              USADF |         23        0.95       13.49
              USAID |      2,089       86.43       99.92
               USDA |          2        0.08      100.00
--------------------+-----------------------------------
              Total |      2,417      100.00

. grmeanby agency if inlist(agency, "DOD", "MCC") ! = 1, summarize(spent)

. grmeanby agency if inlist(agency, "DOS", "Treasury") ! = 1, summarize(spent)

. grmeanby category if inlist(agency, "DOS", "Treasury") ! = 1, summarize(spent)

. help table

. stem spent

Stem-and-leaf plot for spent (Spent)

spent rounded to integers

  -0* | 87555333322111111111
   0* | 000000000000000000000000000000000000000000000000000000000000 ... (2302)
   1* | 000000001111111222333344444455666666666777788899
   2* | 122334566777999
   3* | 0256
   4* | 288
   5* | 0
   6* | 7
   7* | 3
   8* | 
   9* | 49
  10* | 6
  11* | 33
  12* | 2
  13* | 55
  14* | 
  15* | 5
  16* | 
  17* | 
  18* | 
  19* | 
  20* | 9
  21* | 
  22* | 
  23* | 
  24* | 
  25* | 
  26* | 
  27* | 
  28* | 
  29* | 8
  30* | 
  31* | 
  32* | 
  33* | 
  34* | 
  35* | 
  36* | 
  37* | 
  38* | 
  39* | 
  40* | 
  41* | 
  42* | 
  43* | 
  44* | 
  45* | 
  46* | 
  47* | 
  48* | 
  49* | 
  50* | 2

. help stem

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. clear all

. input x1        y1      x2      y2      x3      y3      x4      y4

            x1         y1         x2         y2         x3         y3         x4         y4
  1. 10.0    8.04    10.0    9.14    10.0    7.46    8.0     6.58
  2. 8.0     6.95    8.0     8.14    8.0     6.77    8.0     5.76
  3. 13.0    7.58    13.0    8.74    13.0    12.74   8.0     7.71
  4. 9.0     8.81    9.0     8.77    9.0     7.11    8.0     8.84
  5. 11.0    8.33    11.0    9.26    11.0    7.81    8.0     8.47
  6. 14.0    9.96    14.0    8.10    14.0    8.84    8.0     7.04
  7. 6.0     7.24    6.0     6.13    6.0     6.08    8.0     5.25
  8. 4.0     4.26    4.0     3.10    4.0     5.39    19.0    12.50
  9. 12.0    10.84   12.0    9.13    12.0    8.15    8.0     5.56
 10. 7.0     4.82    7.0     7.26    7.0     6.42    8.0     7.91
 11. 5.0     5.68    5.0     4.74    5.0     5.73    8.0     6.89
 12. end

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. stem y4

Stem-and-leaf plot for y4

y4 rounded to nearest multiple of .01
plot in units of .01

   5** | 25,56,76
   6** | 58,89
   7** | 04,71,91
   8** | 47,84
   9** | 
  10** | 
  11** | 
  12** | 50

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. stem x4

Stem-and-leaf plot for x4

  0. | 8888888888
  1* | 
  1t | 
  1f | 
  1s | 
  1. | 9

. 
end of do-file

. help stem

. help tabsum

. sysuse auto, clear
(1978 Automobile Data)

. tabulate wgtcat foreign, summarize(mpg) means
variable wgtcat not found
r(111);

. tabulate wegith foreign, summarize(mpg) means
variable wegith not found
r(111);

. tabulate weight  foreign, summarize(mpg) means

                          Means of Mileage (mpg)

    Weight |      Car type
    (lbs.) |  Domestic    Foreign |     Total
-----------+----------------------+----------
     1,760 |         .         28 |        28
     1,800 |        31          . |        31
     1,830 |         .         26 |        26
     1,930 |         .         25 |        25
     1,980 |         .         30 |        30
     1,990 |         .         25 |        25
     2,020 |         .         35 |        35
     2,040 |         .         41 |        41
     2,050 |         .         35 |        35
     2,070 |         .         23 |        23
     2,110 |        29          . |        29
     2,120 |        30          . |        30
     2,130 |         .         21 |        21
     2,160 |         .         23 |        23
     2,200 |        25         31 |        28
     2,230 |        26          . |        26
     2,240 |         .         25 |        25
     2,280 |         .         24 |        24
     2,370 |         .         23 |        23
     2,410 |         .         18 |        18
     2,520 |        26          . |        26
     2,580 |        22          . |        22
     2,640 |        22          . |        22
     2,650 |        21         25 |        23
     2,670 |         .         18 |        18
     2,690 |        24          . |        24
     2,730 |        24          . |        24
     2,750 |        24         21 |      22.5
     2,830 |        20         17 |      18.5
     2,930 |        22          . |        22
     3,170 |         .         17 |        17
     3,180 |        22          . |        22
     3,200 |        19          . |        19
     3,210 |        19          . |        19
     3,220 |        22          . |        22
     3,250 |        20          . |        20
     3,260 |        28          . |        28
     3,280 |        20          . |        20
     3,300 |        19          . |        19
     3,310 |        19          . |        19
     3,330 |        18          . |        18
     3,350 |        17          . |        17
     3,370 |      18.5          . |      18.5
     3,400 |        19          . |        19
     3,420 |        19         14 |      16.5
     3,430 |        19          . |        19
     3,470 |        18          . |        18
     3,600 |        17          . |        17
     3,670 |        18          . |        18
     3,690 |        17          . |        17
     3,700 |        18          . |        18
     3,720 |        15          . |        15
     3,740 |        17          . |        17
     3,830 |        14          . |        14
     3,880 |        16          . |        16
     3,900 |        14          . |        14
     4,030 |        16          . |        16
     4,060 |      17.5          . |      17.5
     4,080 |        15          . |        15
     4,130 |        14          . |        14
     4,290 |        21          . |        21
     4,330 |        14          . |        14
     4,720 |        12          . |        12
     4,840 |        12          . |        12
-----------+----------------------+----------
     Total | 19.826923  24.772727 | 21.297297

. tabulate weight  foreign, summarize(mpg)

        Means, Standard Deviations and Frequencies of Mileage (mpg)

    Weight |      Car type
    (lbs.) |  Domestic    Foreign |     Total
-----------+----------------------+----------
     1,760 |         .         28 |        28
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     1,800 |        31          . |        31
           | 4.2426407          . | 4.2426407
           |         2          0 |         2
-----------+----------------------+----------
     1,830 |         .         26 |        26
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     1,930 |         .         25 |        25
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     1,980 |         .         30 |        30
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     1,990 |         .         25 |        25
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,020 |         .         35 |        35
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,040 |         .         41 |        41
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,050 |         .         35 |        35
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,070 |         .         23 |        23
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,110 |        29          . |        29
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     2,120 |        30          . |        30
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     2,130 |         .         21 |        21
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,160 |         .         23 |        23
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,200 |        25         31 |        28
           |         0          0 | 4.2426407
           |         1          1 |         2
-----------+----------------------+----------
     2,230 |        26          . |        26
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     2,240 |         .         25 |        25
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,280 |         .         24 |        24
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,370 |         .         23 |        23
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,410 |         .         18 |        18
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,520 |        26          . |        26
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     2,580 |        22          . |        22
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     2,640 |        22          . |        22
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     2,650 |        21         25 |        23
           |         0          0 | 2.8284271
           |         1          1 |         2
-----------+----------------------+----------
     2,670 |         .         18 |        18
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     2,690 |        24          . |        24
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     2,730 |        24          . |        24
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     2,750 |        24         21 |      22.5
           |         0          0 | 2.1213203
           |         1          1 |         2
-----------+----------------------+----------
     2,830 |        20         17 |      18.5
           |         0          0 | 2.1213203
           |         1          1 |         2
-----------+----------------------+----------
     2,930 |        22          . |        22
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,170 |         .         17 |        17
           |         .          0 |         0
           |         0          1 |         1
-----------+----------------------+----------
     3,180 |        22          . |        22
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,200 |        19          . |        19
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,210 |        19          . |        19
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,220 |        22          . |        22
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,250 |        20          . |        20
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,260 |        28          . |        28
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,280 |        20          . |        20
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,300 |        19          . |        19
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,310 |        19          . |        19
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,330 |        18          . |        18
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,350 |        17          . |        17
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,370 |      18.5          . |      18.5
           | .70710678          . | .70710678
           |         2          0 |         2
-----------+----------------------+----------
     3,400 |        19          . |        19
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,420 |        19         14 |      16.5
           |         0          0 | 3.5355339
           |         1          1 |         2
-----------+----------------------+----------
     3,430 |        19          . |        19
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,470 |        18          . |        18
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,600 |        17          . |        17
           | 1.4142136          . | 1.4142136
           |         2          0 |         2
-----------+----------------------+----------
     3,670 |        18          . |        18
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,690 |        17          . |        17
           | 1.4142136          . | 1.4142136
           |         2          0 |         2
-----------+----------------------+----------
     3,700 |        18          . |        18
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,720 |        15          . |        15
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,740 |        17          . |        17
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,830 |        14          . |        14
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,880 |        16          . |        16
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     3,900 |        14          . |        14
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     4,030 |        16          . |        16
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     4,060 |      17.5          . |      17.5
           | 4.9497475          . | 4.9497475
           |         2          0 |         2
-----------+----------------------+----------
     4,080 |        15          . |        15
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     4,130 |        14          . |        14
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     4,290 |        21          . |        21
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     4,330 |        14          . |        14
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     4,720 |        12          . |        12
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     4,840 |        12          . |        12
           |         0          . |         0
           |         1          0 |         1
-----------+----------------------+----------
     Total | 19.826923  24.772727 | 21.297297
           | 4.7432972  6.6111869 | 5.7855032
           |        52         22 |        74

. tabulate weight  foreign, summarize(mpg) means

                          Means of Mileage (mpg)

    Weight |      Car type
    (lbs.) |  Domestic    Foreign |     Total
-----------+----------------------+----------
     1,760 |         .         28 |        28
     1,800 |        31          . |        31
     1,830 |         .         26 |        26
     1,930 |         .         25 |        25
     1,980 |         .         30 |        30
     1,990 |         .         25 |        25
     2,020 |         .         35 |        35
     2,040 |         .         41 |        41
     2,050 |         .         35 |        35
     2,070 |         .         23 |        23
     2,110 |        29          . |        29
     2,120 |        30          . |        30
     2,130 |         .         21 |        21
     2,160 |         .         23 |        23
     2,200 |        25         31 |        28
     2,230 |        26          . |        26
     2,240 |         .         25 |        25
     2,280 |         .         24 |        24
     2,370 |         .         23 |        23
     2,410 |         .         18 |        18
     2,520 |        26          . |        26
     2,580 |        22          . |        22
     2,640 |        22          . |        22
     2,650 |        21         25 |        23
     2,670 |         .         18 |        18
     2,690 |        24          . |        24
     2,730 |        24          . |        24
     2,750 |        24         21 |      22.5
     2,830 |        20         17 |      18.5
     2,930 |        22          . |        22
     3,170 |         .         17 |        17
     3,180 |        22          . |        22
     3,200 |        19          . |        19
     3,210 |        19          . |        19
     3,220 |        22          . |        22
     3,250 |        20          . |        20
     3,260 |        28          . |        28
     3,280 |        20          . |        20
     3,300 |        19          . |        19
     3,310 |        19          . |        19
     3,330 |        18          . |        18
     3,350 |        17          . |        17
     3,370 |      18.5          . |      18.5
     3,400 |        19          . |        19
     3,420 |        19         14 |      16.5
     3,430 |        19          . |        19
     3,470 |        18          . |        18
     3,600 |        17          . |        17
     3,670 |        18          . |        18
     3,690 |        17          . |        17
     3,700 |        18          . |        18
     3,720 |        15          . |        15
     3,740 |        17          . |        17
     3,830 |        14          . |        14
     3,880 |        16          . |        16
     3,900 |        14          . |        14
     4,030 |        16          . |        16
     4,060 |      17.5          . |      17.5
     4,080 |        15          . |        15
     4,130 |        14          . |        14
     4,290 |        21          . |        21
     4,330 |        14          . |        14
     4,720 |        12          . |        12
     4,840 |        12          . |        12
-----------+----------------------+----------
     Total | 19.826923  24.772727 | 21.297297

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab fiscalyear, sum(spent) means

            | Summary of
            |    Spent
 FiscalYear |        Mean
------------+------------
       2007 |   .02200264
       2008 |   134.58496
       2009 |   1.2157354
       2010 |   2.2451917
       2011 |   2.1161262
       2012 |   3.7153234
       2013 |   1.4205091
       2014 |   1.7822329
------------+------------
      Total |   2.1717564

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab fiscalyear, sum(spent)

            |          Summary of Spent
 FiscalYear |        Mean   Std. Dev.       Freq.
------------+------------------------------------
       2007 |   .02200264           0           1
       2008 |   134.58496           0           1
       2009 |   1.2157354   3.3129589         393
       2010 |   2.2451917   10.751505         401
       2011 |   2.1161262   10.594496         451
       2012 |   3.7153234   28.001944         464
       2013 |   1.4205091   9.9370291         564
       2014 |   1.7822329   9.7135725         132
------------+------------------------------------
      Total |   2.1717564   15.138462        2407

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. table agency fiscalyear if inlist("USAID", agency), /*
> */ c(mean spent sum spent sd spent) f(%9.2fc) row col

------------------------------------------------------------------------------------------
          |                                   FiscalYear                                  
   Agency |     2007      2009      2010      2011      2012      2013      2014     Total
----------+-------------------------------------------------------------------------------
    USAID |     0.02      1.15      2.14      2.21      2.07      0.77      1.41      1.67
          |     0.02    437.93    802.14    946.74    872.41    301.31    117.26  3,477.81
          |               3.12     10.48     10.87      7.96      1.94      4.02      7.76
          | 
    Total |     0.02      1.15      2.14      2.21      2.07      0.77      1.41      1.67
          |     0.02    437.93    802.14    946.74    872.41    301.31    117.26  3,477.81
          |               3.12     10.48     10.87      7.96      1.94      4.02      7.76
------------------------------------------------------------------------------------------

. 
end of do-file

. tabstat spent, by(fiscalyear) stat(mean median sd n) long format col(stat)

fiscalyear     variable |      mean       p50        sd         N
------------------------+----------------------------------------
2007              spent |  .0220026  .0220026         .         1
2008              spent |   134.585   134.585         .         1
2009              spent |  1.215735   .211934  3.312959       393
2010              spent |  2.245192  .2310116  10.75151       401
2011              spent |  2.116126  .1943747   10.5945       451
2012              spent |  3.715323   .223268  28.00194       464
2013              spent |  1.420509  .2116153  9.937029       564
2014              spent |  1.782233  .1639026  9.713572       132
------------------------+----------------------------------------
Total             spent |  2.171756  .2137813  15.13846      2407
-----------------------------------------------------------------

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabstat spent, by(fiscalyear) stat(mean median sd n)

Summary for variables: spent
     by categories of: fiscalyear (FiscalYear)

fiscalyear |      mean       p50        sd         N
-----------+----------------------------------------
      2007 |  .0220026  .0220026         .         1
      2008 |   134.585   134.585         .         1
      2009 |  1.215735   .211934  3.312959       393
      2010 |  2.245192  .2310116  10.75151       401
      2011 |  2.116126  .1943747   10.5945       451
      2012 |  3.715323   .223268  28.00194       464
      2013 |  1.420509  .2116153  9.937029       564
      2014 |  1.782233  .1639026  9.713572       132
-----------+----------------------------------------
     Total |  2.171756  .2137813  15.13846      2407
----------------------------------------------------

. 
end of do-file

. tabstat spent, by(fiscalyear) stat(mean median sd n) long format row(stat)
option row() not allowed
r(198);

. help tabstat

. clear

. sysuse auto
(1978 Automobile Data)

. tabstat price weight mpg rep78, by(foreign) stat(mean sd min max) nototal long col(stat)

foreign      variable |      mean        sd       min       max
----------------------+----------------------------------------
Domestic        price |  6072.423  3097.104      3291     15906
               weight |  3317.115  695.3637      1800      4840
                  mpg |  19.82692  4.743297        12        34
                rep78 |  3.020833   .837666         1         5
----------------------+----------------------------------------
Foreign         price |  6384.682  2621.915      3748     12990
               weight |  2315.909  433.0035      1760      3420
                  mpg |  24.77273  6.611187        14        41
                rep78 |  4.285714  .7171372         3         5
---------------------------------------------------------------

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab agency, gen(agency_flag)
variable agency not found
r(111);

end of do-file

r(111);

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab agency, gen(agency_flag)

             Agency |      Freq.     Percent        Cum.
--------------------+-----------------------------------
                DOD |         24        0.99        0.99
                DOS |         15        0.62        1.61
                IAF |         27        1.12        2.73
                MCC |        141        5.83        8.56
        Peace Corps |         81        3.35       11.92
           Treasury |         15        0.62       12.54
              USADF |         23        0.95       13.49
              USAID |      2,089       86.43       99.92
               USDA |          2        0.08      100.00
--------------------+-----------------------------------
              Total |      2,417      100.00

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabstat spent, by(agency_flag8) stat(mean median sd n) nototal long col(stat)

agency_flag8     variable |      mean       p50        sd         N
--------------------------+----------------------------------------
0                   spent |  5.366894  .2335917    36.042       326
1                   spent |  1.671221   .206975  7.763246      2081
-------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabstat spent, by(agency_flag8) stat(mean median sd n) nototal col(stat)

Summary for variables: spent
     by categories of: agency_flag8 (agency==USAID)

agency_flag8 |      mean       p50        sd         N
-------------+----------------------------------------
           0 |  5.366894  .2335917    36.042       326
           1 |  1.671221   .206975  7.763246      2081
------------------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tabstat spent, by(agency_flag8) stat(mean median sd n)

Summary for variables: spent
     by categories of: agency_flag8 (agency==USAID)

agency_flag8 |      mean       p50        sd         N
-------------+----------------------------------------
           0 |  5.366894  .2335917    36.042       326
           1 |  1.671221   .206975  7.763246      2081
-------------+----------------------------------------
       Total |  2.171756  .2137813  15.13846      2407
------------------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. table agency fiscalyear if inlist("USAID", agency), /*
> */ c(mean spent sum spent sd spent) f(%9.2fc) 

------------------------------------------------------------------
          |                       FiscalYear                      
   Agency |   2007    2009    2010    2011    2012    2013    2014
----------+-------------------------------------------------------
    USAID |   0.02    1.15    2.14    2.21    2.07    0.77    1.41
          |   0.02  437.93  802.14  946.74  872.41  301.31  117.26
          |           3.12   10.48   10.87    7.96    1.94    4.02
------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. table agency fiscalyear, /*
> */ c(mean spent sum spent sd spent) f(%9.2fc) row col

------------------------------------------------------------------------------------------------------
            |                                        FiscalYear                                       
     Agency |     2007      2008      2009      2010      2011      2012      2013      2014     Total
------------+-----------------------------------------------------------------------------------------
        DOD |                                                                           4.76      4.76
            |                                                                         114.16    114.16
            |                                                                          21.61     21.61
            | 
        DOS |                                                      83.62     25.21      0.16     62.48
            |                                                     836.24    100.86      0.16    937.26
            |                                                     173.53     46.03              144.24
            | 
        IAF |                         0.44      0.23      0.10      0.15      0.25      0.19      0.24
            |                         2.19      1.62      0.49      0.45      1.27      0.38      6.40
            |                         0.34      0.18      0.04      0.01      0.21      0.07      0.21
            | 
        MCC |                                                                 2.74                2.74
            |                                                               381.38              381.38
            |                                                                18.07               18.07
            | 
Peace Corps |                                   0.99      0.45      0.67      0.89      0.16      0.59
            |                                  11.89      5.37     14.14     13.34      3.27     48.01
            |                                   0.61      0.61      0.79      0.56      0.13      0.64
            | 
   Treasury |             134.58     17.35     73.30      0.32      0.15      0.32               16.36
            |             134.58     34.69     73.30      0.97      0.61      1.29              245.45
            |                         8.62                0.26      0.18      0.30               37.94
            | 
      USADF |                         0.50      1.89      0.27      0.02      0.10      0.03      0.67
            |                         2.97     11.37      0.80      0.07      0.29      0.03     15.52
            |                         0.52      4.13      0.24      0.01      0.12                2.13
            | 
      USAID |     0.02                1.15      2.14      2.21      2.07      0.77      1.41      1.67
            |     0.02              437.93    802.14    946.74    872.41    301.31    117.26  3,477.81
            |                         3.12     10.48     10.87      7.96      1.94      4.02      7.76
            | 
       USDA |                                                                 0.71                0.71
            |                                                                 1.43                1.43
            |                                                                 0.28                0.28
            | 
      Total |     0.02    134.58      1.22      2.25      2.12      3.72      1.42      1.78      2.17
            |     0.02    134.58    477.78    900.32    954.37  1,723.91    801.17    235.25  5,227.42
            |                         3.31     10.75     10.59     28.00      9.94      9.71     15.14
------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. table fiscalyear if inlist("USAID", agency), /*
> */ c(mean spent sum spent sd spent) f(%9.2fc) 

-------------------------------------------------
FiscalYea |
r         | mean(spent)   sum(spent)    sd(spent)
----------+--------------------------------------
     2007 |        0.02         0.02             
     2009 |        1.15       437.93         3.12
     2010 |        2.14       802.14        10.48
     2011 |        2.21       946.74        10.87
     2012 |        2.07       872.41         7.96
     2013 |        0.77       301.31         1.94
     2014 |        1.41       117.26         4.02
-------------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. table fiscalyear qtr if inlist("USAID", agency), /*
> */ c(mean spent sum spent sd spent) f(%9.2fc) 

------------------------------------------
FiscalYea |              QTR              
r         |      1       2       3       4
----------+-------------------------------
     2007 |                           0.02
          |                           0.02
          |                               
          | 
     2009 |   0.75    0.97    0.82    1.66
          |  58.32   86.64   59.37  233.60
          |   1.93    2.97    2.48    3.91
          | 
     2010 |   1.03    0.76    2.28    3.65
          |  76.44   64.95  212.03  448.72
          |   3.98    1.61   12.20   14.44
          | 
     2011 |   2.83    1.02    1.45    2.99
          | 280.65   96.43  138.11  407.19
          |  16.12    3.08    4.28   12.64
          | 
     2012 |   2.09    2.30    1.69    2.12
          | 219.79  207.06  138.57  306.99
          |   7.40   11.92    4.54    6.80
          | 
     2013 |   0.62    0.66    0.77    0.95
          |  43.28   75.01   66.52  114.51
          |   1.91    2.27    1.27    2.03
          | 
     2014 |           1.41                
          |         117.26                
          |           4.02                
------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. bysort agency: table fiscalyear qtr, c(sum spent) f(%9.2fc)

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = DOD
no observations

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = DOS

------------------------------------------
FiscalYea |              QTR              
r         |      1       2       3       4
----------+-------------------------------
     2012 | 516.35   14.08  298.20    7.61
     2013 |           6.49   94.12    0.24
     2014 |           0.16                
------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = IAF
no observations

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = MCC

------------------------------------------
FiscalYea |              QTR              
r         |      1       2       3       4
----------+-------------------------------
     2013 |  77.55   32.86  227.31   43.66
------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = Peace Corps

------------------------
FiscalYea |     QTR     
r         |     1      2
----------+-------------
     2010 | 11.89       
     2011 |  5.37       
     2012 | 14.14       
     2013 | 13.34       
     2014 |  1.55   1.72
------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = Treasury
no observations

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = USADF
no observations

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = USAID

------------------------------------------
FiscalYea |              QTR              
r         |      1       2       3       4
----------+-------------------------------
     2007 |                           0.02
     2009 |  58.32   86.64   59.37  233.60
     2010 |  76.44   64.95  212.03  448.72
     2011 | 280.65   96.43  138.11  407.19
     2012 | 219.79  207.06  138.57  306.99
     2013 |  43.28   75.01   66.52  114.51
     2014 |         117.26                
------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = USDA

----------------------
FiscalYea |    QTR    
r         |    1     3
----------+-----------
     2013 | 0.91  0.52
----------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. egen tot_spent = total(spent), by(qtr fiscalyear agency)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. scatter(connected tot_spent qtr) if agency == "USAID", by(fiscalyear) scheme(s1color)
variable connected not found
r(111);

end of do-file

r(111);

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. twoway(connected tot_spent qtr) if agency == "USAID", by(fiscalyear) scheme(s1color)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. twoway(connected tot_spent qtr, sort) if agency == "USAID", by(fiscalyear) scheme(s1color)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. egen tot_spent_cat = total(spent) if agency == "USAID", by(qtr fiscalyear category)
(328 missing values generated)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. table agency fiscalyear, /*
> */ c(mean spent sum spent sd spent) f(%9.2fc) row col

------------------------------------------------------------------------------------------------------
            |                                        FiscalYear                                       
     Agency |     2007      2008      2009      2010      2011      2012      2013      2014     Total
------------+-----------------------------------------------------------------------------------------
        DOD |                                                                           4.76      4.76
            |                                                                         114.16    114.16
            |                                                                          21.61     21.61
            | 
        DOS |                                                      83.62     25.21      0.16     62.48
            |                                                     836.24    100.86      0.16    937.26
            |                                                     173.53     46.03              144.24
            | 
        IAF |                         0.44      0.23      0.10      0.15      0.25      0.19      0.24
            |                         2.19      1.62      0.49      0.45      1.27      0.38      6.40
            |                         0.34      0.18      0.04      0.01      0.21      0.07      0.21
            | 
        MCC |                                                                 2.74                2.74
            |                                                               381.38              381.38
            |                                                                18.07               18.07
            | 
Peace Corps |                                   0.99      0.45      0.67      0.89      0.16      0.59
            |                                  11.89      5.37     14.14     13.34      3.27     48.01
            |                                   0.61      0.61      0.79      0.56      0.13      0.64
            | 
   Treasury |             134.58     17.35     73.30      0.32      0.15      0.32               16.36
            |             134.58     34.69     73.30      0.97      0.61      1.29              245.45
            |                         8.62                0.26      0.18      0.30               37.94
            | 
      USADF |                         0.50      1.89      0.27      0.02      0.10      0.03      0.67
            |                         2.97     11.37      0.80      0.07      0.29      0.03     15.52
            |                         0.52      4.13      0.24      0.01      0.12                2.13
            | 
      USAID |     0.02                1.15      2.14      2.21      2.07      0.77      1.41      1.67
            |     0.02              437.93    802.14    946.74    872.41    301.31    117.26  3,477.81
            |                         3.12     10.48     10.87      7.96      1.94      4.02      7.76
            | 
       USDA |                                                                 0.71                0.71
            |                                                                 1.43                1.43
            |                                                                 0.28                0.28
            | 
      Total |     0.02    134.58      1.22      2.25      2.12      3.72      1.42      1.78      2.17
            |     0.02    134.58    477.78    900.32    954.37  1,723.91    801.17    235.25  5,227.42
            |                         3.31     10.75     10.59     28.00      9.94      9.71     15.14
------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. table agency fiscalyear, /*
> */ c(mean spent sd spent) f(%9.2fc) row col

------------------------------------------------------------------------------------
            |                               FiscalYear                              
     Agency |   2007    2008    2009    2010    2011    2012    2013    2014   Total
------------+-----------------------------------------------------------------------
        DOD |                                                           4.76    4.76
            |                                                          21.61   21.61
            | 
        DOS |                                          83.62   25.21    0.16   62.48
            |                                         173.53   46.03          144.24
            | 
        IAF |                   0.44    0.23    0.10    0.15    0.25    0.19    0.24
            |                   0.34    0.18    0.04    0.01    0.21    0.07    0.21
            | 
        MCC |                                                   2.74            2.74
            |                                                  18.07           18.07
            | 
Peace Corps |                           0.99    0.45    0.67    0.89    0.16    0.59
            |                           0.61    0.61    0.79    0.56    0.13    0.64
            | 
   Treasury |         134.58   17.35   73.30    0.32    0.15    0.32           16.36
            |                   8.62            0.26    0.18    0.30           37.94
            | 
      USADF |                   0.50    1.89    0.27    0.02    0.10    0.03    0.67
            |                   0.52    4.13    0.24    0.01    0.12            2.13
            | 
      USAID |   0.02            1.15    2.14    2.21    2.07    0.77    1.41    1.67
            |                   3.12   10.48   10.87    7.96    1.94    4.02    7.76
            | 
       USDA |                                                   0.71            0.71
            |                                                   0.28            0.28
            | 
      Total |   0.02  134.58    1.22    2.25    2.12    3.72    1.42    1.78    2.17
            |                   3.31   10.75   10.59   28.00    9.94    9.71   15.14
------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. table agency fiscalyear, /*
> */ c(mean spent count spent) f(%9.2fc) row col

------------------------------------------------------------------------------------
            |                               FiscalYear                              
     Agency |   2007    2008    2009    2010    2011    2012    2013    2014   Total
------------+-----------------------------------------------------------------------
        DOD |                                                           4.76    4.76
            |                                                             24      24
            | 
        DOS |                                          83.62   25.21    0.16   62.48
            |                                             10       4       1      15
            | 
        IAF |                   0.44    0.23    0.10    0.15    0.25    0.19    0.24
            |                      5       7       5       3       5       2      27
            | 
        MCC |                                                   2.74            2.74
            |                                                    139             139
            | 
Peace Corps |                           0.99    0.45    0.67    0.89    0.16    0.59
            |                             12      12      21      15      21      81
            | 
   Treasury |         134.58   17.35   73.30    0.32    0.15    0.32           16.36
            |              1       2       1       3       4       4              15
            | 
      USADF |                   0.50    1.89    0.27    0.02    0.10    0.03    0.67
            |                      6       6       3       4       3       1      23
            | 
      USAID |   0.02            1.15    2.14    2.21    2.07    0.77    1.41    1.67
            |      1             380     375     428     422     392      83   2,081
            | 
       USDA |                                                   0.71            0.71
            |                                                      2               2
            | 
      Total |   0.02  134.58    1.22    2.25    2.12    3.72    1.42    1.78    2.17
            |      1       1     393     401     451     464     564     132   2,407
------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear 

. 
end of do-file

. help summarize

. help tab_chi

. help tabsort

. help means

. mean spent

Mean estimation                     Number of obs    =    2407

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
       spent |   2.171756   .3085629       1.56668    2.776833
--------------------------------------------------------------

. sum spent

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |      2407    2.171756    15.13846    -7.6169   501.9166

. help mean

. webuse fuel

. br

. stack mpg1 mpg2, into(mpg) clear

. br

. help collapse

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear 

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. bys fiscalyear: table agency category, c(sum spent count spent mean spent) f(%12.2fc)

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2007

------------------------
          |   Category  
   Agency |       Health
----------+-------------
    USAID |         0.02
          |            1
          |         0.02
------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2008

------------------------
          |   Category  
   Agency | Multi-Sector
----------+-------------
 Treasury |       134.58
          |            1
          |       134.58
------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2009

------------------------------------------------------------------------------------------------------------------------------------------------------
          |                                                                  Category                                                                 
   Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Multi-Sector  Peace And Se  Program Mana
----------+-------------------------------------------------------------------------------------------------------------------------------------------
      IAF |                                                                                             2.19                                          
          |                                                                                                5                                          
          |                                                                                             0.44                                          
          | 
 Treasury |                                                                                                          34.69                            
          |                                                                                                              2                            
          |                                                                                                          17.35                            
          | 
    USADF |                                                                                             2.97                                          
          |                                                                                                6                                          
          |                                                                                             0.50                                          
          | 
    USAID |        55.50         58.54         19.15          6.33        106.99         62.26                                      4.74        124.42
          |           61            63            28            13            95            38                                        21            61
          |         0.91          0.93          0.68          0.49          1.13          1.64                                      0.23          2.04
------------------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2010

--------------------------------------------------------------------------------------------------------------------------------------------------------
            |                                                                  Category                                                                 
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Multi-Sector  Peace And Se  Program Mana
------------+-------------------------------------------------------------------------------------------------------------------------------------------
        IAF |                                                                                             1.62                                          
            |                                                                                                7                                          
            |                                                                                             0.23                                          
            | 
Peace Corps |                                                                                            11.89                                          
            |                                                                                               12                                          
            |                                                                                             0.99                                          
            | 
   Treasury |                                                                                                          73.30                            
            |                                                                                                              1                            
            |                                                                                                          73.30                            
            | 
      USADF |                                                                                            11.37                                          
            |                                                                                                6                                          
            |                                                                                             1.89                                          
            | 
      USAID |        35.26        149.56        144.36         21.13        208.50        149.21                                      4.36         89.77
            |           70            61            23            18            93            22                                        13            75
            |         0.50          2.45          6.28          1.17          2.24          6.78                                      0.34          1.20
--------------------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2011

------------------------------------------------------------------------------------------------------------------------------------------
            |                                                           Category                                                          
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Peace And Se  Program Mana
------------+-----------------------------------------------------------------------------------------------------------------------------
        IAF |                                                                                             0.49                            
            |                                                                                                5                            
            |                                                                                             0.10                            
            | 
Peace Corps |                                                                                             5.37                            
            |                                                                                               12                            
            |                                                                                             0.45                            
            | 
   Treasury |                       0.87                                                                                0.10              
            |                          2                                                                                   1              
            |                       0.44                                                                                0.10              
            | 
      USADF |                                                                                             0.80                            
            |                                                                                                3                            
            |                                                                                             0.27                            
            | 
      USAID |        54.54         66.24        289.67          6.75        393.28         60.38                       19.65         56.24
            |           71            76            44            11            86            31                          17            92
            |         0.77          0.87          6.58          0.61          4.57          1.95                        1.16          0.61
------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2012

------------------------------------------------------------------------------------------------------------------------------------------
            |                                                           Category                                                          
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Peace And Se  Program Mana
------------+-----------------------------------------------------------------------------------------------------------------------------
        DOS |                                                                                           836.24                            
            |                                                                                               10                            
            |                                                                                            83.62                            
            | 
        IAF |                                                                                             0.45                            
            |                                                                                                3                            
            |                                                                                             0.15                            
            | 
Peace Corps |                                                                                            14.14                            
            |                                                                                               21                            
            |                                                                                             0.67                            
            | 
   Treasury |                       0.04                                                                                0.57              
            |                          2                                                                                   2              
            |                       0.02                                                                                0.28              
            | 
      USADF |                                                                                             0.07                            
            |                                                                                                4                            
            |                                                                                             0.02                            
            | 
      USAID |       100.95        105.11         73.23         20.93        323.16        133.73                       33.35         81.96
            |           65            56            36            15            87            37                          20           106
            |         1.55          1.88          2.03          1.40          3.71          3.61                        1.67          0.77
------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2013

--------------------------------------------------------------------------------------------------------------------------------------------------------
            |                                                                  Category                                                                 
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Multi-Sector  Peace And Se  Program Mana
------------+-------------------------------------------------------------------------------------------------------------------------------------------
        DOS |                                                                                           100.86                                          
            |                                                                                                4                                          
            |                                                                                            25.21                                          
            | 
        IAF |                                                                                             1.27                                          
            |                                                                                                5                                          
            |                                                                                             0.25                                          
            | 
        MCC |         0.06        334.35          7.54         -0.46                                                   19.64                       20.24
            |            1            57             8             2                                                      51                          20
            |         0.06          5.87          0.94         -0.23                                                    0.39                        1.01
            | 
Peace Corps |                                                                                            13.34                                          
            |                                                                                               15                                          
            |                                                                                             0.89                                          
            | 
   Treasury |                                                                               0.69          0.44                        0.16              
            |                                                                                  2             1                           1              
            |                                                                               0.34          0.44                        0.16              
            | 
      USADF |                                                                                             0.29                                          
            |                                                                                                3                                          
            |                                                                                             0.10                                          
            | 
      USAID |        36.09         68.84         25.08         15.05         71.64         33.99                                      5.85         44.78
            |           56            72            26            14            79            31                                        16            98
            |         0.64          0.96          0.96          1.07          0.91          1.10                                      0.37          0.46
            | 
       USDA |                                                                                             1.43                                          
            |                                                                                                2                                          
            |                                                                                             0.71                                          
--------------------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2014

------------------------------------------------------------------------------------------------------------------------------------------
            |                                                           Category                                                          
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Peace And Se  Program Mana
------------+-----------------------------------------------------------------------------------------------------------------------------
        DOD |                     109.48                                                    0.11                        4.57              
            |                          2                                                       1                          21              
            |                      54.74                                                    0.11                        0.22              
            | 
        DOS |                                                                                             0.16                            
            |                                                                                                1                            
            |                                                                                             0.16                            
            | 
        IAF |                                                                                             0.38                            
            |                                                                                                2                            
            |                                                                                             0.19                            
            | 
Peace Corps |                                                                                             3.27                            
            |                                                                                               21                            
            |                                                                                             0.16                            
            | 
      USADF |                                                                                             0.03                            
            |                                                                                                1                            
            |                                                                                             0.03                            
            | 
      USAID |         3.03          4.34          7.09          3.66         59.08         25.21                       12.00          2.85
            |            7             6             4             5            21            13                           4            23
            |         0.43          0.72          1.77          0.73          2.81          1.94                        3.00          0.12
------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. cls

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. * Task: Create table showing aggregate category spending for each agency by year
. 
end of do-file

. cls

. * Task: Create table showing aggregate category spending for each agency by year

. 
. * bys fiscalyear: table agency category, c(sum spent count spent mean spent) f(%12.2fc)

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. * bys fiscalyear: table agency category, c(sum spent count spent mean spent) f(%12.2fc)
. 
end of do-file

. cls

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. * Task: Create table showing aggregate category spending for each agency by year
. bys fiscalyear: table agency category, c(sum spent count spent mean spent) f(%12.2fc)

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2007

------------------------
          |   Category  
   Agency |       Health
----------+-------------
    USAID |         0.02
          |            1
          |         0.02
------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2008

------------------------
          |   Category  
   Agency | Multi-Sector
----------+-------------
 Treasury |       134.58
          |            1
          |       134.58
------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2009

------------------------------------------------------------------------------------------------------------------------------------------------------
          |                                                                  Category                                                                 
   Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Multi-Sector  Peace And Se  Program Mana
----------+-------------------------------------------------------------------------------------------------------------------------------------------
      IAF |                                                                                             2.19                                          
          |                                                                                                5                                          
          |                                                                                             0.44                                          
          | 
 Treasury |                                                                                                          34.69                            
          |                                                                                                              2                            
          |                                                                                                          17.35                            
          | 
    USADF |                                                                                             2.97                                          
          |                                                                                                6                                          
          |                                                                                             0.50                                          
          | 
    USAID |        55.50         58.54         19.15          6.33        106.99         62.26                                      4.74        124.42
          |           61            63            28            13            95            38                                        21            61
          |         0.91          0.93          0.68          0.49          1.13          1.64                                      0.23          2.04
------------------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2010

--------------------------------------------------------------------------------------------------------------------------------------------------------
            |                                                                  Category                                                                 
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Multi-Sector  Peace And Se  Program Mana
------------+-------------------------------------------------------------------------------------------------------------------------------------------
        IAF |                                                                                             1.62                                          
            |                                                                                                7                                          
            |                                                                                             0.23                                          
            | 
Peace Corps |                                                                                            11.89                                          
            |                                                                                               12                                          
            |                                                                                             0.99                                          
            | 
   Treasury |                                                                                                          73.30                            
            |                                                                                                              1                            
            |                                                                                                          73.30                            
            | 
      USADF |                                                                                            11.37                                          
            |                                                                                                6                                          
            |                                                                                             1.89                                          
            | 
      USAID |        35.26        149.56        144.36         21.13        208.50        149.21                                      4.36         89.77
            |           70            61            23            18            93            22                                        13            75
            |         0.50          2.45          6.28          1.17          2.24          6.78                                      0.34          1.20
--------------------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2011

------------------------------------------------------------------------------------------------------------------------------------------
            |                                                           Category                                                          
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Peace And Se  Program Mana
------------+-----------------------------------------------------------------------------------------------------------------------------
        IAF |                                                                                             0.49                            
            |                                                                                                5                            
            |                                                                                             0.10                            
            | 
Peace Corps |                                                                                             5.37                            
            |                                                                                               12                            
            |                                                                                             0.45                            
            | 
   Treasury |                       0.87                                                                                0.10              
            |                          2                                                                                   1              
            |                       0.44                                                                                0.10              
            | 
      USADF |                                                                                             0.80                            
            |                                                                                                3                            
            |                                                                                             0.27                            
            | 
      USAID |        54.54         66.24        289.67          6.75        393.28         60.38                       19.65         56.24
            |           71            76            44            11            86            31                          17            92
            |         0.77          0.87          6.58          0.61          4.57          1.95                        1.16          0.61
------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2012

------------------------------------------------------------------------------------------------------------------------------------------
            |                                                           Category                                                          
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Peace And Se  Program Mana
------------+-----------------------------------------------------------------------------------------------------------------------------
        DOS |                                                                                           836.24                            
            |                                                                                               10                            
            |                                                                                            83.62                            
            | 
        IAF |                                                                                             0.45                            
            |                                                                                                3                            
            |                                                                                             0.15                            
            | 
Peace Corps |                                                                                            14.14                            
            |                                                                                               21                            
            |                                                                                             0.67                            
            | 
   Treasury |                       0.04                                                                                0.57              
            |                          2                                                                                   2              
            |                       0.02                                                                                0.28              
            | 
      USADF |                                                                                             0.07                            
            |                                                                                                4                            
            |                                                                                             0.02                            
            | 
      USAID |       100.95        105.11         73.23         20.93        323.16        133.73                       33.35         81.96
            |           65            56            36            15            87            37                          20           106
            |         1.55          1.88          2.03          1.40          3.71          3.61                        1.67          0.77
------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2013

--------------------------------------------------------------------------------------------------------------------------------------------------------
            |                                                                  Category                                                                 
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Multi-Sector  Peace And Se  Program Mana
------------+-------------------------------------------------------------------------------------------------------------------------------------------
        DOS |                                                                                           100.86                                          
            |                                                                                                4                                          
            |                                                                                            25.21                                          
            | 
        IAF |                                                                                             1.27                                          
            |                                                                                                5                                          
            |                                                                                             0.25                                          
            | 
        MCC |         0.06        334.35          7.54         -0.46                                                   19.64                       20.24
            |            1            57             8             2                                                      51                          20
            |         0.06          5.87          0.94         -0.23                                                    0.39                        1.01
            | 
Peace Corps |                                                                                            13.34                                          
            |                                                                                               15                                          
            |                                                                                             0.89                                          
            | 
   Treasury |                                                                               0.69          0.44                        0.16              
            |                                                                                  2             1                           1              
            |                                                                               0.34          0.44                        0.16              
            | 
      USADF |                                                                                             0.29                                          
            |                                                                                                3                                          
            |                                                                                             0.10                                          
            | 
      USAID |        36.09         68.84         25.08         15.05         71.64         33.99                                      5.85         44.78
            |           56            72            26            14            79            31                                        16            98
            |         0.64          0.96          0.96          1.07          0.91          1.10                                      0.37          0.46
            | 
       USDA |                                                                                             1.43                                          
            |                                                                                                2                                          
            |                                                                                             0.71                                          
--------------------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2014

------------------------------------------------------------------------------------------------------------------------------------------
            |                                                           Category                                                          
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Peace And Se  Program Mana
------------+-----------------------------------------------------------------------------------------------------------------------------
        DOD |                     109.48                                                    0.11                        4.57              
            |                          2                                                       1                          21              
            |                      54.74                                                    0.11                        0.22              
            | 
        DOS |                                                                                             0.16                            
            |                                                                                                1                            
            |                                                                                             0.16                            
            | 
        IAF |                                                                                             0.38                            
            |                                                                                                2                            
            |                                                                                             0.19                            
            | 
Peace Corps |                                                                                             3.27                            
            |                                                                                               21                            
            |                                                                                             0.16                            
            | 
      USADF |                                                                                             0.03                            
            |                                                                                                1                            
            |                                                                                             0.03                            
            | 
      USAID |         3.03          4.34          7.09          3.66         59.08         25.21                       12.00          2.85
            |            7             6             4             5            21            13                           4            23
            |         0.43          0.72          1.77          0.73          2.81          1.94                        3.00          0.12
------------------------------------------------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. * Hard to do, let's try to collapse the data
. collapse (sum) spent (count) count = spent (mean) ave_spent = spent /*
> */, by(agency category fiscalyear)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear 

. 
end of do-file

. drop operatingunit

. compress
  agency was str19 now str11
  (19,336 bytes saved)

. br

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. collapse (sum) spent (count) count = spent (mean) ave_spent = spent /*
> */, by(agency category fiscalyear)

. 
end of do-file

. br

. sort agency fiscalyear category

. br

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear 

. 
end of do-file

. order fiscalyear agency category spent

. tab fiscalyeartype

FiscalYearTyp |
            e |      Freq.     Percent        Cum.
--------------+-----------------------------------
Disbursements |      1,533       63.43       63.43
  Obligations |        884       36.57      100.00
--------------+-----------------------------------
        Total |      2,417      100.00

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. keep if fiscalyeartype == "Disbursements"
(884 observations deleted)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. sum

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  fiscalyear |      1533    2011.258    1.514444       2007       2014
      agency |         0
    category |         0
       spent |      1533    1.197106    6.496679    -7.6169   154.5814
         qtr |      1467    2.454669    1.128127          1          4
-------------+--------------------------------------------------------
fiscalyear~e |         0
     account |         0
operatingu~t |         0
benefiting~y |         0
      sector |         0
-------------+--------------------------------------------------------
      amount |         0
      spent2 |      1533     1197106     6496679   -7616900   1.55e+08
  notCountry |      1533    .1650359    .3713341          0          1

. sum spent, detail 

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.1555388        -7.6169
 5%     .0000685          -6.69
10%     .0025134      -3.445094       Obs                1533
25%       .02875      -2.479624       Sum of Wgt.        1533

50%     .1751409                      Mean           1.197106
                        Largest       Std. Dev.      6.496679
75%     .6599205           73.3
90%     1.863215       106.1701       Variance       42.20684
95%     3.731603       112.6652       Skewness       16.09504
99%     16.50232       154.5814       Kurtosis       316.3286

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. bysort fiscalyear: sum spent

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2007

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |         1    .0220026           .   .0220026   .0220026

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2009

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |       255    .8717569    2.763036      -6.69   23.43839

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2010

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |       275    1.162722    5.404683  -.1555388       73.3

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2011

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |       299    1.588721    9.519164  -.0651504   154.5814

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2012

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |       299    1.358597    7.133421  -.0427131   112.6652

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2013

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |       326    .7730126    1.859113    -7.6169   15.95373

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2014

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       spent |        78    2.049296    12.07663  -.2586957   106.1701


. bysort fiscalyear: sum spent if inlist("USAID", agency), d

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2007

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0220026       .0220026
 5%     .0220026              .
10%     .0220026              .       Obs                   1
25%     .0220026              .       Sum of Wgt.           1

50%     .0220026                      Mean           .0220026
                        Largest       Std. Dev.             .
75%     .0220026              .
90%     .0220026              .       Variance              .
95%     .0220026              .       Skewness              .
99%     .0220026       .0220026       Kurtosis              .

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2009

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0004035          -6.69
 5%      .001282      -.0052498
10%     .0035976      -.0004035       Obs                 245
25%     .0302991       -.000022       Sum of Wgt.         245

50%     .1598754                      Mean           .7514577
                        Largest       Std. Dev.      2.322877
75%     .5946825       13.82994
90%     1.364325       15.50167       Variance       5.395755
95%     3.021921       16.28706       Skewness       5.201688
99%     15.50167       18.49886       Kurtosis       35.15353

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2010

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -.000471      -.1555388
 5%      .000411      -.0043028
10%     .0019324       -.000471       Obs                 261
25%     .0209095      -.0001515       Sum of Wgt.         261

50%         .175                      Mean           .9187224
                        Largest       Std. Dev.      3.268228
75%     .6223429       18.76738
90%      1.32157       21.60419       Variance       10.68132
95%      2.76868       26.78583       Skewness       6.699596
99%     21.60419       30.33898       Kurtosis       51.41472

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2011

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -.003665      -.0651504
 5%     .0001071      -.0263088
10%     .0020782       -.003665       Obs                 286
25%     .0198146      -.0007985       Sum of Wgt.         286

50%     .1432397                      Mean           1.645094
                        Largest       Std. Dev.      9.729334
75%     .5978361       15.69071
90%     2.288279       16.50232       Variance       94.65994
95%     6.211971       42.01596       Skewness        13.9642
99%     16.50232       154.5814       Kurtosis        216.101

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2012

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.0062284      -.0427131
 5%     .0000357      -.0065958
10%     .0045035      -.0062284       Obs                 282
25%     .0319357       -.004109       Sum of Wgt.         282

50%     .1795351                      Mean           1.420697
                        Largest       Std. Dev.      7.340577
75%     .8405629       24.69525
90%       2.1784       26.03365       Variance       53.88407
95%     4.089603       28.62951       Skewness       12.88418
99%     26.03365       112.6652       Kurtosis       189.9557

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2013

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -.25       -.403556
 5%    -.0027873      -.2744585
10%     .0001893           -.25       Obs                 233
25%     .0191393      -.2121905       Sum of Wgt.         233

50%     .1549002                      Mean           .6174022
                        Largest       Std. Dev.      1.345542
75%     .5364341          5.187
90%     1.642884       5.489411       Variance       1.810484
95%     2.896134       8.009582       Skewness       5.002704
99%     5.489411       13.02041       Kurtosis       37.86868

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2014

                            Spent
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -.2586957      -.2586957
 5%        .0057       .0005949
10%     .0098911          .0057       Obs                  48
25%     .0872933       .0096917       Sum of Wgt.          48

50%     .2276641                      Mean           .9556874
                        Largest       Std. Dev.      2.208022
75%     .7733792       2.674218
90%      2.18903       4.601889       Variance       4.875363
95%     4.601889           5.86       Skewness       4.445111
99%     13.69908       13.69908       Kurtosis         24.826


. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. tab fiscalyear agency, mi

           |                                               Agency
FiscalYear |       DOD        DOS        IAF        MCC  Peace C..   Treasury      USADF      USAID       USDA |     Total
-----------+---------------------------------------------------------------------------------------------------+----------
      2007 |         0          0          0          0          0          0          0          1          0 |         1 
      2009 |         0          0          5          0          0          2          3        245          0 |       255 
      2010 |         0          0          3          0          6          1          4        261          0 |       275 
      2011 |         0          0          5          0          2          3          3        286          0 |       299 
      2012 |         0          1          3          0          9          3          1        282          0 |       299 
      2013 |         0          0          5         75          6          3          2        233          2 |       326 
      2014 |        17          0          2          0         10          0          1         48          0 |        78 
-----------+---------------------------------------------------------------------------------------------------+----------
     Total |        17          1         23         75         33         12         14      1,356          2 |     1,533 


. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. table fiscalyear qtr if inlist("USAID", agency), /*
> */ c(mean spent sum spent sd spent) f(%9.2fc) 

------------------------------------------
FiscalYea |              QTR              
r         |      1       2       3       4
----------+-------------------------------
     2007 |                           0.02
          |                           0.02
          |                               
          | 
     2009 |   0.80    0.58    0.51    1.06
          |  50.57   37.59   25.95   70.00
          |   2.11    2.22    1.40    3.08
          | 
     2010 |   1.11    0.55    1.04    0.95
          |  69.76   34.34   74.96   60.72
          |   4.30    1.18    3.93    2.63
          | 
     2011 |   3.45    0.93    1.25    0.73
          | 272.56   68.71   76.43   52.79
          |  18.01    2.77    3.00    1.70
          | 
     2012 |   1.02    2.73    1.95    0.47
          |  82.38  169.21  110.89   38.16
          |   3.33   14.32    5.16    0.73
          | 
     2013 |   0.78    0.44    0.68    0.63
          |  39.05   29.65   35.19   39.97
          |   2.17    0.88    1.18    1.01
          | 
     2014 |           0.96                
          |          45.87                
          |           2.21                
------------------------------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. bysort agency: table fiscalyear qtr, c(sum spent) f(%9.2fc)

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = DOD
no observations

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = DOS

----------------
FiscalYea | QTR 
r         |    3
----------+-----
     2012 | 0.22
----------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = IAF
no observations

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = MCC

--------------------------------------
FiscalYea |            QTR            
r         |     1      2      3      4
----------+---------------------------
     2013 | 32.74  14.34  16.74  35.04
--------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = Peace Corps

----------------------
FiscalYea |    QTR    
r         |    1     2
----------+-----------
     2010 | 4.91      
     2011 | 2.27      
     2012 | 4.32      
     2013 | 5.68      
     2014 | 0.48  1.33
----------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = Treasury
no observations

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = USADF
no observations

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = USAID

------------------------------------------
FiscalYea |              QTR              
r         |      1       2       3       4
----------+-------------------------------
     2007 |                           0.02
     2009 |  50.57   37.59   25.95   70.00
     2010 |  69.76   34.34   74.96   60.72
     2011 | 272.56   68.71   76.43   52.79
     2012 |  82.38  169.21  110.89   38.16
     2013 |  39.05   29.65   35.19   39.97
     2014 |          45.87                
------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agency = USDA

----------------------
FiscalYea |    QTR    
r         |    1     3
----------+-----------
     2013 | 0.91  0.52
----------------------

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. egen tot_spent = total(spent), by(qtr fiscalyear agency)

. twoway(connected tot_spent qtr, sort) if agency == "USAID", by(fiscalyear) scheme(s1color)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. egen tot_spent = total(spent), by(qtr fiscalyear agency fiscalyeartype)

. twoway(connected tot_spent qtr, sort) if agency == "USAID", by(fiscalyear) scheme(s1color)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. twoway(connected tot_spent qtr, sort) if agency == "USAID" & fiscalyeartype == "Obligations" /*
> */, by(fiscalyear) scheme(s1color)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. twoway(connected tot_spent qtr, sort) if agency == "USAID" & fiscalyeartype == "Disbursements" /*
> */, by(fiscalyear) scheme(s1color)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear 

. 
end of do-file

. order fiscalyear agency category spent

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. collapse (sum) spent (count) count = spent (mean) ave_spent = spent /*
> */, by(agency category fiscalyear)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear 

. 
end of do-file

. sort agency fiscalyear category

. sort fiscalyear agency category

. br

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear 

. 
end of do-file

. sort agency fiscalyear category

. drop operatingunit

. sort agency fiscalyear category spent

. br

. order agency fiscalyear category spent

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear 

. order agency fiscalyear category spent

. 
end of do-file

. return list

scalars:
                  r(N) =  2417

. ereturn list

scalars:
               e(df_r) =  2406
             e(N_over) =  1
                  e(N) =  2407
               e(k_eq) =  1
               e(rank) =  1

macros:
            e(cmdline) : "mean spent"
                e(cmd) : "mean"
                e(vce) : "analytic"
              e(title) : "Mean estimation"
          e(estat_cmd) : "estat_vce_only"
            e(varlist) : "spent"
       e(marginsnotok) : "_ALL"
         e(properties) : "b V"
             e(depvar) : "Mean"

matrices:
                  e(b) :  1 x 1
                  e(V) :  1 x 1
                 e(_N) :  1 x 1
              e(error) :  1 x 1

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear 

. order agency fiscalyear category spent

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. collapse (sum) spent (count) count = spent (mean) ave_spent = spent /*
> */, by(agency category fiscalyear)

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear 

. order agency fiscalyear category spent

. 
. * Task: Create table showing aggregate category spending for each agency by year
. bys fiscalyear: table agency category, c(sum spent count spent mean spent) f(%12.2fc)

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2007

------------------------
          |   Category  
   Agency |       Health
----------+-------------
    USAID |         0.02
          |            1
          |         0.02
------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2008

------------------------
          |   Category  
   Agency | Multi-Sector
----------+-------------
 Treasury |       134.58
          |            1
          |       134.58
------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2009

------------------------------------------------------------------------------------------------------------------------------------------------------
          |                                                                  Category                                                                 
   Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Multi-Sector  Peace And Se  Program Mana
----------+-------------------------------------------------------------------------------------------------------------------------------------------
      IAF |                                                                                             2.19                                          
          |                                                                                                5                                          
          |                                                                                             0.44                                          
          | 
 Treasury |                                                                                                          34.69                            
          |                                                                                                              2                            
          |                                                                                                          17.35                            
          | 
    USADF |                                                                                             2.97                                          
          |                                                                                                6                                          
          |                                                                                             0.50                                          
          | 
    USAID |        55.50         58.54         19.15          6.33        106.99         62.26                                      4.74        124.42
          |           61            63            28            13            95            38                                        21            61
          |         0.91          0.93          0.68          0.49          1.13          1.64                                      0.23          2.04
------------------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2010

--------------------------------------------------------------------------------------------------------------------------------------------------------
            |                                                                  Category                                                                 
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Multi-Sector  Peace And Se  Program Mana
------------+-------------------------------------------------------------------------------------------------------------------------------------------
        IAF |                                                                                             1.62                                          
            |                                                                                                7                                          
            |                                                                                             0.23                                          
            | 
Peace Corps |                                                                                            11.89                                          
            |                                                                                               12                                          
            |                                                                                             0.99                                          
            | 
   Treasury |                                                                                                          73.30                            
            |                                                                                                              1                            
            |                                                                                                          73.30                            
            | 
      USADF |                                                                                            11.37                                          
            |                                                                                                6                                          
            |                                                                                             1.89                                          
            | 
      USAID |        35.26        149.56        144.36         21.13        208.50        149.21                                      4.36         89.77
            |           70            61            23            18            93            22                                        13            75
            |         0.50          2.45          6.28          1.17          2.24          6.78                                      0.34          1.20
--------------------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2011

------------------------------------------------------------------------------------------------------------------------------------------
            |                                                           Category                                                          
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Peace And Se  Program Mana
------------+-----------------------------------------------------------------------------------------------------------------------------
        IAF |                                                                                             0.49                            
            |                                                                                                5                            
            |                                                                                             0.10                            
            | 
Peace Corps |                                                                                             5.37                            
            |                                                                                               12                            
            |                                                                                             0.45                            
            | 
   Treasury |                       0.87                                                                                0.10              
            |                          2                                                                                   1              
            |                       0.44                                                                                0.10              
            | 
      USADF |                                                                                             0.80                            
            |                                                                                                3                            
            |                                                                                             0.27                            
            | 
      USAID |        54.54         66.24        289.67          6.75        393.28         60.38                       19.65         56.24
            |           71            76            44            11            86            31                          17            92
            |         0.77          0.87          6.58          0.61          4.57          1.95                        1.16          0.61
------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2012

------------------------------------------------------------------------------------------------------------------------------------------
            |                                                           Category                                                          
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Peace And Se  Program Mana
------------+-----------------------------------------------------------------------------------------------------------------------------
        DOS |                                                                                           836.24                            
            |                                                                                               10                            
            |                                                                                            83.62                            
            | 
        IAF |                                                                                             0.45                            
            |                                                                                                3                            
            |                                                                                             0.15                            
            | 
Peace Corps |                                                                                            14.14                            
            |                                                                                               21                            
            |                                                                                             0.67                            
            | 
   Treasury |                       0.04                                                                                0.57              
            |                          2                                                                                   2              
            |                       0.02                                                                                0.28              
            | 
      USADF |                                                                                             0.07                            
            |                                                                                                4                            
            |                                                                                             0.02                            
            | 
      USAID |       100.95        105.11         73.23         20.93        323.16        133.73                       33.35         81.96
            |           65            56            36            15            87            37                          20           106
            |         1.55          1.88          2.03          1.40          3.71          3.61                        1.67          0.77
------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2013

--------------------------------------------------------------------------------------------------------------------------------------------------------
            |                                                                  Category                                                                 
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Multi-Sector  Peace And Se  Program Mana
------------+-------------------------------------------------------------------------------------------------------------------------------------------
        DOS |                                                                                           100.86                                          
            |                                                                                                4                                          
            |                                                                                            25.21                                          
            | 
        IAF |                                                                                             1.27                                          
            |                                                                                                5                                          
            |                                                                                             0.25                                          
            | 
        MCC |         0.06        334.35          7.54         -0.46                                                   19.64                       20.24
            |            1            57             8             2                                                      51                          20
            |         0.06          5.87          0.94         -0.23                                                    0.39                        1.01
            | 
Peace Corps |                                                                                            13.34                                          
            |                                                                                               15                                          
            |                                                                                             0.89                                          
            | 
   Treasury |                                                                               0.69          0.44                        0.16              
            |                                                                                  2             1                           1              
            |                                                                               0.34          0.44                        0.16              
            | 
      USADF |                                                                                             0.29                                          
            |                                                                                                3                                          
            |                                                                                             0.10                                          
            | 
      USAID |        36.09         68.84         25.08         15.05         71.64         33.99                                      5.85         44.78
            |           56            72            26            14            79            31                                        16            98
            |         0.64          0.96          0.96          1.07          0.91          1.10                                      0.37          0.46
            | 
       USDA |                                                                                             1.43                                          
            |                                                                                                2                                          
            |                                                                                             0.71                                          
--------------------------------------------------------------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> fiscalyear = 2014

------------------------------------------------------------------------------------------------------------------------------------------
            |                                                           Category                                                          
     Agency | Democracy, H  Economic Dev  Education An   Environment        Health  Humanitarian       Missing  Peace And Se  Program Mana
------------+-----------------------------------------------------------------------------------------------------------------------------
        DOD |                     109.48                                                    0.11                        4.57              
            |                          2                                                       1                          21              
            |                      54.74                                                    0.11                        0.22              
            | 
        DOS |                                                                                             0.16                            
            |                                                                                                1                            
            |                                                                                             0.16                            
            | 
        IAF |                                                                                             0.38                            
            |                                                                                                2                            
            |                                                                                             0.19                            
            | 
Peace Corps |                                                                                             3.27                            
            |                                                                                               21                            
            |                                                                                             0.16                            
            | 
      USADF |                                                                                             0.03                            
            |                                                                                                1                            
            |                                                                                             0.03                            
            | 
      USAID |         3.03          4.34          7.09          3.66         59.08         25.21                       12.00          2.85
            |            7             6             4             5            21            13                           4            23
            |         0.43          0.72          1.77          0.73          2.81          1.94                        3.00          0.12
------------------------------------------------------------------------------------------------------------------------------------------

. 
. * Hard to do, let's try to collapse the data
. collapse (sum) spent (count) count = spent (mean) ave_spent = spent /*
> */, by(agency category fiscalyear)

. 
. * Can you plot or summarize aggregate spending now?
. 
. local labopts "ylabel(, labsize(small) angle(horizontal)) xlabel(, labsize(vsmall))"

. local layout "by(category, rows(2)) subtitle(, size(tiny) fcolor("245 245 245") bexpand)"

. local lineopt "lcolor("210 210 210") mcolor("215 215 215")"

. local gopts "graphregion(fcolor(none) ifcolor(none))"

. 
. twoway(connected spent fiscalyear, `lineopt')/*
> */if agency == "USAID", by(category) yscale(noline) `labopts' `layout' scheme(s1mono) `gopts'

. 
. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. 
. clear all

. input x1        y1      x2      y2      x3      y3      x4      y4

            x1         y1         x2         y2         x3         y3         x4         y4
  1. 10.0    8.04    10.0    9.14    10.0    7.46    8.0     6.58
  2. 8.0     6.95    8.0     8.14    8.0     6.77    8.0     5.76
  3. 13.0    7.58    13.0    8.74    13.0    12.74   8.0     7.71
  4. 9.0     8.81    9.0     8.77    9.0     7.11    8.0     8.84
  5. 11.0    8.33    11.0    9.26    11.0    7.81    8.0     8.47
  6. 14.0    9.96    14.0    8.10    14.0    8.84    8.0     7.04
  7. 6.0     7.24    6.0     6.13    6.0     6.08    8.0     5.25
  8. 4.0     4.26    4.0     3.10    4.0     5.39    19.0    12.50
  9. 12.0    10.84   12.0    9.13    12.0    8.15    8.0     5.56
 10. 7.0     4.82    7.0     7.26    7.0     6.42    8.0     7.91
 11. 5.0     5.68    5.0     4.74    5.0     5.73    8.0     6.89
 12. end

. save "quartet.dta", replace
file quartet.dta saved

. 
.  * What are the means for each data set?
.  sum x* 

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
          x1 |        11           9    3.316625          4         14
          x2 |        11           9    3.316625          4         14
          x3 |        11           9    3.316625          4         14
          x4 |        11           9    3.316625          8         19

.  sum y*

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
          y1 |        11    7.500909    2.031568       4.26      10.84
          y2 |        11    7.500909    2.031657        3.1       9.26
          y3 |        11         7.5    2.030424       5.39      12.74
          y4 |        11    7.500909    2.030579       5.25       12.5

.  
.  * Show the correlations between x & y for each series
.  forvalues i = 1/4 {
  2.         pwcorr x`i' y`i'
  3.         twoway(scatter y`i' x`i')(lfit y`i' x`i'), scheme(s1color) /*
>         */ name(series`i', replace) nodraw
  4.         }

             |       x1       y1
-------------+------------------
          x1 |   1.0000 
          y1 |   0.8164   1.0000 

             |       x2       y2
-------------+------------------
          x2 |   1.0000 
          y2 |   0.8162   1.0000 

             |       x3       y3
-------------+------------------
          x3 |   1.0000 
          y3 |   0.8163   1.0000 

             |       x4       y4
-------------+------------------
          x4 |   1.0000 
          y4 |   0.8165   1.0000 

. * end
. 
. * Combine the graphs into a single plot
. graph combine series1 series2 series3 series4, cols(2) ycommon xcommon 

. 
. * What is going on?
. * Series one is linear relationship, appears to be normally distributed
. * Series two nonlinear
. * Series three has one outlier
. * series four has an extreme outlier that drives results
. 
. * PLOT YOUR DATA!
. stem x4

Stem-and-leaf plot for x4

  0. | 8888888888
  1* | 
  1t | 
  1f | 
  1s | 
  1. | 9

. inspect 

x1:                                             Number of Observations
-----                                       ------------------------------
                                            Total   Integers   Nonintegers
|                  #         Negative           -         -          -
|                  #         Zero               -         -          -
|  #   #   #   #   #         Positive          11        11          -
|  #   #   #   #   #                        -----     -----      -----
|  #   #   #   #   #         Total             11        11          -
|  #   #   #   #   #         Missing            -
+----------------------                     -----
4                    14                        11
  (11 unique values)

y1:                                             Number of Observations
-----                                       ------------------------------
                                            Total   Integers   Nonintegers
|          #                 Negative           -         -          -
|          #                 Zero               -         -          -
|          #                 Positive          11         -         11
|  #       #   #   #                        -----     -----      -----
|  #       #   #   #         Total             11         -         11
|  #   #   #   #   #         Missing            -
+----------------------                     -----
4.26              10.84                        11
  (11 unique values)

x2:                                             Number of Observations
-----                                       ------------------------------
                                            Total   Integers   Nonintegers
|                  #         Negative           -         -          -
|                  #         Zero               -         -          -
|  #   #   #   #   #         Positive          11        11          -
|  #   #   #   #   #                        -----     -----      -----
|  #   #   #   #   #         Total             11        11          -
|  #   #   #   #   #         Missing            -
+----------------------                     -----
4                    14                        11
  (11 unique values)

y2:                                             Number of Observations
-----                                       ------------------------------
                                            Total   Integers   Nonintegers
|                  #         Negative           -         -          -
|                  #         Zero               -         -          -
|                  #         Positive          11         -         11
|                  #                        -----     -----      -----
|                  #         Total             11         -         11
|  .   .   .   .   #         Missing            -
+----------------------                     -----
3.1                9.26                        11
  (11 unique values)

x3:                                             Number of Observations
-----                                       ------------------------------
                                            Total   Integers   Nonintegers
|                  #         Negative           -         -          -
|                  #         Zero               -         -          -
|  #   #   #   #   #         Positive          11        11          -
|  #   #   #   #   #                        -----     -----      -----
|  #   #   #   #   #         Total             11        11          -
|  #   #   #   #   #         Missing            -
+----------------------                     -----
4                    14                        11
  (11 unique values)

y3:                                             Number of Observations
-----                                       ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero               -         -          -
|  #   #                     Positive          11         -         11
|  #   #                                    -----     -----      -----
|  #   #                     Total             11         -         11
|  #   #   #   .   #         Missing            -
+----------------------                     -----
5.39              12.74                        11
  (11 unique values)

x4:                                             Number of Observations
-----                                       ------------------------------
                                            Total   Integers   Nonintegers
|  #                         Negative           -         -          -
|  #                         Zero               -         -          -
|  #                         Positive          11        11          -
|  #                                        -----     -----      -----
|  #                         Total             11        11          -
|  #   .                     Missing            -
+----------------------                     -----
8                    19                        11
   (2 unique values)

y4:                                             Number of Observations
-----                                       ------------------------------
                                            Total   Integers   Nonintegers
|  #   #                     Negative           -         -          -
|  #   #                     Zero               -         -          -
|  #   #                     Positive          11         -         11
|  #   #   #                                -----     -----      -----
|  #   #   #                 Total             11         -         11
|  #   #   #   .   #         Missing            -
+----------------------                     -----
5.25               12.5                        11
  (11 unique values)

. 
end of do-file

. stem
varlist required
r(100);

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear 

. 
end of do-file

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. use "StataTrainingClean.dta", clear

. 
. * Keep only observations from agency == USAID
. keep if inlist(agency, "USAID)
too few quotes
r(132);

end of do-file

r(132);

. do "C:\Users\t\AppData\Local\Temp\STD00000000.tmp"

. keep if inlist(agency, "USAID")
(328 observations deleted)

. 
end of do-file

. count
 2089

. tab agency

             Agency |      Freq.     Percent        Cum.
--------------------+-----------------------------------
              USAID |      2,089      100.00      100.00
--------------------+-----------------------------------
              Total |      2,089      100.00

. exit, clear
